[
    {
      "id": 1,
      "title": "Careernet helps a US headquartered multinational conglomerate set up their Global Capability Centre in India",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/12/Thumbnail_Banner_Dec_2022-400x299.png",
      "excerpt": "Founded in 1960 as a family-owned company, our client is one of the largest privately held companies in America today. They came to India, looking to...",
      "link": "#"
    },
    {
      "id": 2,
      "title": "Careernet provides seamless TA operations support to a globally leading US tech MNC",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/07/1200-x-628-400x299.png",
      "excerpt": "Our client, an American multinational technology corporation, has been driving the digital transformation of start-ups, businesses, and government agencies in India by providing global cloud services. a...",
      "link": "#"
    },
    {
      "id": 3,
      "title": "Careernet Goes International: Supporting a Global Internet Giant with Hiring Software Professionals in the US",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/02/E-com-case-study-400x299.png",
      "excerpt": "Our client, a global internet giant with business operations ranging from e-commerce to data centers, digital content to publishing, and hi-tech to consumer electronics, was founded...",
      "link": "#"
    },
    {
      "id": 4,
      "title": "Our targeted search helped a leading American retail MNC hire a person with disability for its HR operations",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_262/https://careernet.in/wp-content/uploads/2021/12/CareerNet-Prism-Case-Study_-LGBTQ-PRIDE-1-%E2%80%93-1-960x628.png",
      "excerpt": "A leading American multinational retail corporation, headquartered in the U.S., approached us to find someone from the diverse community for the role of Associate Analyst...",
      "link": "#"
    },
    {
      "id": 5,
      "title": "Careernet Prism Helps a London-based Multinational Media Conglomerate Find the Best Diverse Talent for its Tech Operations",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_262/https://careernet.in/wp-content/uploads/2021/12/CareerNet-Prism-places-PwD-Candidate-1-960x628.png",
      "excerpt": "A world-renowned, London-based business information services provider was looking for a suitable candidate for the Automation Developer position from the diverse community. They approached us to...",
      "link": "#"
    },
    {
      "id": 6,
      "title": "LONGHOUSE finds a supply chain leader for asia’s leading e-commerce company through cross-border search",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/11/CN_Casestudy_03-768x413.jpg",
      "excerpt": "LONGHOUSE finds a supply chain leader for Asia’s leading e-commerce company through cross-border search Our client, one of India’s leading digital commerce entities, was faced with...",
      "link": "#"
    },
    {
      "id": 7,
      "title": "LONGHOUSE finds a global leader as the head of strategy for asia’s leading e-commerce company",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/11/CN_Casestudy_02-768x413.jpg",
      "excerpt": "Asia’s leading e-commerce company finds their head of strategy One of the top 5 global e-commerce companies wanted to drive business growth while tackling global...",
      "link": "#"
    },
    {
      "id": 8,
      "title": "LONGHOUSE finds a global tech leader as the CEO for India’s leading stock broking company",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/11/CN_Casestudy_01-768x412.jpg",
      "excerpt": "A cross-border search to find the CEO for India’s leading stock broking firm A leading retail broking firm in India, now a fintech company, was looking...",
      "link": "#"
    },
    {
      "id": 9,
      "title": "Careernet finds the foundational team in India for a US-based data services start-up",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_379/https://careernet.in/wp-content/uploads/2021/10/researchstudy2.jpg",
      "excerpt": "India is one of the world’s most progressive nations with a diverse talent landscape. According to World Banks’ ease of doing business ranking, India has moved...",
      "link": "#"
    },
    {
      "id": 10,
      "title": "Careernet helped a US-based SaaS unicorn hire techies for domain-specific roles",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_379/https://careernet.in/wp-content/uploads/2021/10/researchstudy3.jpg",
      "excerpt": "Our client, a promisingly growing American SAAS provider stepped into the Indian marketplace in 2018. The company wanted to increase their reach in India to find...",
      "link": "#"
    },
    {
      "id": 11,
      "title": "Careernet helped a US tech MNC hire 26 Techies in six months",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_379/https://careernet.in/wp-content/uploads/2021/11/case-stuides_images_1-1_resized.jpg",
      "excerpt": "Our client, an American multinational company, headquartered in San Jose, California, and incorporated in Delaware, builds, and offers computer software across the globe. The company needed...",
      "link": "#"
    },
    {
      "id": 12,
      "title": "Off-campus hiring program",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_379/https://careernet.in/wp-content/uploads/2021/10/researchstudy.jpg",
      "excerpt": "A multinational Engineering & Electronics company. Features amongst the largest supplier of automotive components across the globe…. Our client, one of the leading automotive suppliers in...",
      "link": "#"
    }
  ]
  