[
  {
    "id": 1,
    "title": "TCS offers quirky titles and little else in recruiting revamp to attract 40K hires",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2024/04/CTS-Lede-1024x575-1-400x299.jpg",
    "excerpt": "Like many in south Indian states, folks in parts of Latin America affectionately call their grandfather “tata”. That was enough for Tata Consultancy Services (TCS) to […]",
    "link": "https://the-ken.com/story/tcs-has-an-ingenious-plan-to-rethink-hiring/",
    "desc": [
      "Like many in south Indian states, folks in parts of Latin America affectionately call their grandfather “tata”. That was enough for Tata Consultancy Services (TCS) to attempt a gentle tug at the heartstrings in hopes of boosting hiring in the Spanish-speaking region.",
      "In a self-proclaimed nod to its nearly six-decade information technology (IT) presence, TCS launched a campaign there from 2018 onwards, urging prospective recruits to join the grandfather of all IT firms.",
      "So in 2020, TCS launched a three-tier framework to attract freshers in India. At the centre of this is its entrance exam, the national qualifier test (NQT). Depending on their scores on the six-year-old test, new hires are placed into quirkily-named brackets—Ninja, Digital, and Prime.",
      "However, unlike its supporting sector, the IT industry has an evergreen supply of students from engineering colleges across India. This begs the question: why do IT services companies feel compelled to rebrand their hiring efforts?",
      "To explain this, S Pasupathi, chief operating officer at recruitment firm Careernet, drew inspiration from India’s automotive space, likening the cost-efficient and dependable nature of Maruti Suzuki to that of IT firms.",
      "He detailed how India’s top carmaker tapped a higher-paying category of customers by merely adding Nexa—a provider of premium sedans and hatchbacks—as another tier to its existing broad base.",
      "Similarly, the IT companies added roles with higher salary slabs to signal to clients and colleges that, although they are known for cost-efficiency, they can roll out the big bucks to capture top talent, added Pasupathi."
    ]
  },
  {
    "id": 2,
    "title": "Budget 2024: HR leaders rally for tax incentives and skill development focus",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/02/98614792-400x299.webp",
    "excerpt": "As the interim budget 2024 is just one day away, human resource leaders want the government to prioritise the HRTech segment. Industry captains sector along with their HR tech partners.",
    "link": "https://www.peoplematters.in/article/business/budget-2024-hr-leaders-rally-for-tax-incentives-and-skill-development-focus-40157",
    "desc": [
      "As the interim budget 2024 is just one day away, human resource leaders want the government to prioritise the HRTech segment. Industry captains voiced their hopes for policies driving digital transformation in their sector along with their HR tech partners.",
      "Anshuman Das, CEO and Co-founder, Careernet, wants the government to enhance the infrastructure in Bangalore and similar IT hubs; otherwise, the entire IT industry in India may face challenges.",
      "“Additionally, incentives for companies hiring and training freshers are vital to prevent wage inflation and maintain India’s competitiveness. Rather than direct government spending on IT skilling, redirecting the budget through companies for more meaningful upskilling is recommended. Providing employees with direct tax breaks for upskilling and training expenses is crucial for continuous self-upgradation of the workforce,” says Das."
    ]
  },
  {
    "id": 3,
    "title": "Techies with Generative AI skills see a 30-50 percent jump in salaries",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/04/artificial-intelligence-2023-11-27-05-21-19-utc-400x299.jpg",
    "excerpt": "Techies in India are driving up salaries with additional AI, Generative AI and adjacent skills, commanding as high as 30-50 percent premium over those without...",
    "link": "https://www.moneycontrol.com/news/technology/techies-with-generative-ai-skills-see-a-30-50-percent-jump-in-salaries-12638061.html",
    "desc": [
      "An MBA degree—regarded by many as a ticket to the corporate corridors—may just be losing its premium value in the job market.",
      "Several company officials and HR heads ET spoke to say a classical MBA degree is losing out to the current market trend of hiring talent with specialised skills and those who come at a lesser cost. Ironically, this fall in demand for MBA degree holders comes at a time when their supply is increasing. A record 330,000 candidates from across India registered for the Common Admission Test (CAT) in 2023, a 30% increase from the previous year – a reflection of the aspirational value of the degree.",
      "One of the major triggers for this (fall in demand for MBAs) is the cost, said Anshuman Das, CEO of talent solutions platform Careernet. Besides, job descriptions have become clearer in terms of skill requirements and focus is on skill-based hiring, he said.",
      "The problem is not just with the long-tail institutes; even MBAs from premier IIMs were seen struggling with summer internships this year."
    ]
  },
  {
    "id": 4,
    "title": "IIT placements dip 15% in phase 1, but pay unchanged amid slump",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/12/IIT-placements-dip-400x299.jpg",
    "excerpt": "Despite a market slump and macroeconomic headwinds, compensation packages at the country’s leading Indian Institutes of Technology (IITs) remain at the same level as the previous two years,..",
    "link": "https://economictimes.indiatimes.com/jobs/fresher/iit-placements-dip-15-in-phase-1-but-pay-unchanged-amid-slump/articleshow/105912156.cms",
    "desc": [
      "Despite a market slump and macroeconomic headwinds, compensation packages at the country’s leading Indian Institutes of Technology (IITs) remain at the same level as the previous two years, but they are anxious about fewer placements in the next round, according to an analysis by Careernet, a campus-to-boardroom talent solutions company.",
      "The median CTC in FY24 stands at Rs 20 lakh versus Rs 22 lakh in FY23 and Rs 19 lakh in FY22, as per an analysis of placement data from IITs by Careernet. The highest overseas package offered this year was Rs 3 crore, up from Rs 2 crore in the previous year. The analysis is based on the salary packages offered in the first one week of the current placement season across 22 IITs.",
      "“Overall IITs are hovering around 45-50% placement and we can expect another 5% this week. Phase 1 on an overall basis should be 52-55%, which is a 10-15% dip compared to a usual year,” said Anshuman Das, CEO, Careernet.",
      "The IITs are now putting a lot of focus in Phase 2. “They will try to get to 75-77%. In this, the top 8 IITs should cover around 30% more in Phase 2 to get their usual target of 90-95%,” said Das."
    ]
  },
  {
    "id": 5,
    "title": "Is there light at the end of the tunnel for tech sector workers?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/10/Is-there-light-at-the-end-of-the-tunnel-for-tech-sector-workers-400x299.jpg",
    "excerpt": "Tech giants have given campus hiring a miss. Experts say there may be a 65% drop in recruitment of tech freshers this fiscal. Find out when will the tech workers breathe easy?",
    "link": "https://www.business-standard.com/amp/shows/the-morning-show/is-there-light-at-the-end-of-the-tunnel-for-tech-sector-workers-3299.htm",
    "desc": [
      "Tech giants have given campus hiring a miss. Experts say there may be a 65% drop in recruitment of tech freshers this fiscal. Find out when will the tech workers breathe easy?"
    ]
  },
  {
    "id": 6,
    "title": "Why the ‘IT jobs’ halo is fading even among second-tier colleges",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/02/1665923517-4102-400x299.jpg",
    "excerpt": "Most companies in India today, in whichever sphere they operate, are beefing up their IT capabilities. Banks have been compelled to do so as customers prefer are from non-tech companies.",
    "link": "https://www.financialexpress.com/business/industry-tech-jobs-moving-beyond-it-firms-3289954/",
    "desc": [
      "Most companies in India today, in whichever sphere they operate, are beefing up their IT capabilities. Banks have been compelled to do so as customers prefer transactions on the app or online.",
      "All of this is creating abundant work opportunities for software professionals, especially at a time when the IT service sector is facing an uncertain global environment. Unlike in the past, the majority of tech-related openings, posted across job sites today, are from non-tech companies.",
      "A major public sector bank recently said it is gearing up to be a major IT-driven powerhouse. A few days before that, Dabur became India’s first FMCG firm to complete cloud migration. Earlier this year, Boeing declared it would open its new and second-largest campus outside its global headquarters in Virginia, at Aerospace Park in Bengaluru.",
      "India’s IT industry today employs close to 5.5 million employees. As per a recent report from talent solutions provider Careernet, the emerging EV sector is set to create 5 million direct jobs and 30 million indirect jobs, for technology professionals, by 2030."
    ]
  },
  {
    "id": 7,
    "title": "Candidates dilute resumes as job market tightens",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/Candidates-dilute-resumes-as-job-market-tightens-1-400x299.jpg",
    "excerpt": "Job hunters are playing down their skills and experience to match the required role, even if it means accepting lower designation and pay, at a time the job market is turning tight. Multiple banking,diluting their resumes and skill sets for jobs in manufacturing and allied industries.",
    "link": "https://www.livemint.com/economy/candidates-dilute-resumes-as-job-market-tightens-11686768560850.html",
    "desc": [
      "Job hunters are playing down their skills and experience to match the required role, even if it means accepting lower designation and pay, at a time the job market is turning tight. Multiple executives from recruitment firms said candidates in the junior and middle order in IT, banking, and retail sectors are diluting their resumes and skill sets for jobs in manufacturing and allied industries.",
      "“Managers are willing to move in as individual contributors and not ask for a team lead position, salaries quoted are at par or even reduced, and even the designations are negotiable,” said Anshuman Das, the chief executive officer (CEO) and co-founder of Careernet, a talent solutions provider."
    ]
  },
  {
    "id": 8,
    "title": "Why a four-day work week could prove to be detrimental to employee stress levels?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/04/shutterstock_2193207939-400x299.jpg",
    "excerpt": "The implementation of the four-day work week has been a topic of growing interest among companies, as it is perceived as a potential strategy to increase productivity and employee satisfaction.",
    "link": "https://timesofindia.indiatimes.com/blogs/voices/why-a-four-day-work-week-could-prove-to-be-detrimental-to-employee-stress-levels/",
    "desc": [
      "The implementation of the four-day work week has been a topic of growing interest among companies, as it is perceived as a potential strategy to increase productivity and employee satisfaction.",
      "Recently, the Government of India has taken the initiative to formalise this concept by including it as a provision in the new labour laws. This provision allows companies to offer their employees the option of working four days per week, as an alternative to the standard five-day workweek. However, it is important to note that this policy stipulates increased daily working hours of 12 hours, as opposed to the conventional 8–9 hours.",
      "In an ideal world, fewer days in the office should translate to happier, more productive employees. The concept of an extra day to detach, rejuvenate and recharge sounds like a recipe for a golden workforce, which might be true to an extent. However, as with any change, it is important to consider the potential drawbacks before implementing such a policy. One area of concern is the potential for increased stress levels among employees."
    ]
  },
  {
    "id": 9,
    "title": "Building up diversity by breaking down biases in the workplace",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/Careernet-Prism-offers-several-solutions-400x299.webp",
    "excerpt": "Workplace diversity and inclusion (D&I) are no longer merely notions that companies use to promote a positive employer brand. This term is at the forefront of every conversation about organisational resilience and growth.",
    "link": "https://timesofindia.indiatimes.com/blogs/voices/building-up-diversity-by-breaking-down-biases-in-the-workplace/",
    "desc": [
      "Workplace diversity and inclusion (D&I) are no longer merely notions that companies use to promote a positive employer brand. This term is at the forefront of every conversation about organisational resilience and growth.",
      "Indian organisations have also begun to place a stronger emphasis on Diversity and Inclusion in the workforce by creating new positions such as “Diversity Officer,” “Chief Diversity Officer,” and “Diversity and Inclusion Consultant.” Building diverse teams benefits recruitment, retention, and improved teamwork while also improving performance. An inclusive workplace culture benefits businesses greatly by assisting them in attracting and retaining the most varied and talented individuals, which in turn increases employee engagement.",
      "According to a survey conducted by Careernet, India’s leading talent solutions provider, during an annual career fair for women, 89 per cent of respondents believe it is still important for every company to strive for gender diversity, with 33 per cent revealing that they were denied a raise when they asked for one.",
      "Careernet Prism offers several solutions for hiring diverse talent and building inclusive workplaces, such as exclusive virtual career fairs to hire diverse talent, women returnship initiatives, training programmes for employee resource groups and infrastructure audit and readiness, to name a few."
    ]
  },
  {
    "id": 10,
    "title": "78 percent Indian workers uneasy about job security amid layoffs: Survey",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/01/shutterstock_1529313695-400x299.jpg",
    "excerpt": "Rising inflation, fear of recession and job security amid layoffs are the trends that are making the Indian workforce cautious in 2023.",
    "link": "https://www.cnbctv18.com/education/78-percent-indian-workers-uneasy-about-job-security-amid-layoffs-survey-15784871.htm",
    "desc": [
      "Rising inflation, fear of recession and job security amid layoffs are the trends that are making the Indian workforce cautious in 2023.",
      "According to LinkedIn Workforce, Confidence Index, 74 percent of Indian workers are concerned about rising prices and inflation and only 43 percent of Indian workers feel that they are prepared for an economic downturn.",
      "According to Anshuman Das, CEO and Co-founder, Careernet, professionals are switching jobs to avoid uncertainties amidst layoffs and companies are facing funding winter issues in the case of startups.",
      "“The uncertainty that people feel about their current jobs is the primary factor that is driving professionals to move out of their organisations, regardless of the present economic status quo,” said Das."
    ]
  },
  {
    "id": 11,
    "title": "Is that promotion elusive? Here are some ways to land it",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/02/Is-that-promotion-elusive-400x299.png",
    "excerpt": "Securing a promotion at work can be challenging because of various reasons, especially as the environment has become highly competitive today. Understanding what is expected of",
    "link": "https://www.livemint.com/economy/india-inc-reconsiders-wfh-hiring-as-covid-cases-go-up-11671987129845.html",
    "desc": [
      "India Inc. is taking a cautious approach to its hiring plans in view of the rising covid-19 cases in many countries, coupled with fears of a global recession. Companies in the tourism, hospitality, transport and real estate sectors are also considering work-from-home options if a fourth wave hits India.",
      "Hospitality, automobile, commercial and office real estate, Travel, transportation and mobility will be on high alert,” said Anshuman Das, chief executive officer and co-founder of Careernet, a talent solutions provider."
    ]
  }, 
  {
    "id": 12,
    "title": "Jobs spurt in India’s sunrise sectors, but where’s the talent?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/02/Jobs-spurt-in-Indias-sunrise-sectors-but-wheres-the-talent-400x299.jpg",
    "excerpt": "A world marked by rapid technological changes is also fast transforming the skills required in jobs, making it difficult for employers to find suitable talent. Anshuman",
    "link": "https://economictimes.indiatimes.com/tech/technology/laid-off-professionals-approach-placements-startups-amid-job-crunch/articleshow/95477257.cms",
    "desc": [
          "As a wave of fresh job cuts sweeps across the edtech sector, laid-off professionals and worried employees at troubled firms are reaching out for placements. Recruitment firms as well as startups that are hiring are seeing a big influx of calls and resumes from edtech professionals looking for new jobs, as trouble in the sector looks likely to escalate.",
          "Job consultants say many are willing to take pay cuts of even 20-40%. At the senior level, it could go up, even more, factoring in the value of ESOPs.",
          "“The edtech sector didn’t factor in the possibility that things might move back to a physical model after the pandemic. Now they are suffering the consequences,” says Anshuman Das, managing partner of executive search firm Longhouse Consulting. He cites the case of a former top honcho at an affected edtech firm who was getting Rs 3 crore plus in cash plus nearly three times the amount in ESOPs. Initially unwilling to compromise on his salary, he is now willing to settle for a cut.",
          "Tech, sales and marketing, content, product developers, teachers and contractual staff like testers, have all been affected. While the first two categories have comparatively more opportunities, teachers are among the worst hit. Many came in at 40-50% hikes when the sector was booming and have now been left high and dry, adds Das."
      ]
  },
  {
    "id": 13,
    "title": "How Women are reshaping male-dominated tech industries in India Inc.",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/02/EC_Gen_AI_08_Technology_750-400x299.jpg",
    "excerpt": "For decades, the growing tech industry in India has been predominantly shaped by male professionals, leading to a glaring gender disparity across all levels. But there",
    "link": "https://www.thehindu.com/business/virtual-fair-to-offer-100-jobs-for-women-across-it-domains/article65814461.ece",
    "desc": [
        "In a move aimed at furthering careers of women employees, Careernet, a talent solutions provider, has partnered with a bunch of firms to organise a virtual event that will offer more than 100 jobs.",
        "Careernet will hold a career fair for women at 11 a.m. on Saturday in association with Biocon and Sapiens and roll out offers in companies such as Hitachi, Biocon, Sapiens, Shell, Smith and Nephew, PubMatic and Solera."
    ]
},
{
  "id":14,
  "title": "‘Women’s participation in workforce jumps to 37%’",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/03/Building-a-psychologically-safe-workplace-for-a-diverse-workforce-400x299.jpg",
  "excerpt": "The participation of women in the workforce has increased to 37% in the 2022-23 financial year, a sharp increase from 23.3% in the 2017-18 financial year",
  "link": "https://economictimes.indiatimes.com/jobs/c-suite/dealing-with-layoffs-how-companies-and-ceos-can-handle-a-messy-situation-with-relative-ease/articleshow/109303794.cms",
  "desc": [
      "One of the toughest decisions a CEO has to take is that of laying off people. The reasons for layoffs can vary but there is a lot that CEOs and C-suite executives can do to seamlessly navigate this difficult moment with sensitivity.",
      "Anshuman Das, CEO, Careernet, says layoffs come in three forms: performance-led layoffs, business-led layoffs and disciplinary layoffs.",
      "In performance-led form layoffs, organisations may implement performance improvement programmes (PIPs) to provide constructive feedback, address compensation issues, provide job rotational opportunities, and ensure effective teamwork to maximise improvement opportunities for an employee before considering a layoff."
  ]
},
{
  "id": 15,
  "title": "Interim Budget for Naya Bharat",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/02/Interim-Budget-2024-25-400x299.jpg",
  "excerpt": "Union Finance Minister Nirmala Sitharaman presented the Interim Budget for 2024-2025, setting India on a path towards ‘Viksit Bharat‘ by 2047. This budget was marked by",
  "link": "https://economictimes.indiatimes.com/jobs/c-suite/the-making-of-a-chief-strategy-officer-traits-skills-and-abilities/articleshow/107221643.cms",
  "desc": [
      "The role of the chief strategy officer (CSO) is to set and steer the firm’s strategy. The CSO plays a pivotal, cross-functional role within the company, designing and implementing various strategies. They collaborate closely with other executives and departments, matching business objectives with internal capabilities, competitive landscapes, and market trends.",
      "Neelabh Shukla, Chief Business Officer, Careernet, says, “The chief strategy officer plays a pivotal, cross-functional role within a company, influencing both internal operations and external growth strategies. The CSO is responsible for designing and implementing various strategies, ranging from people and business strategies to recruitment, marketing and sales strategies. They are deeply involved in shaping the company’s future growth plans and positioning within the industry.”"
  ]
},
{
  "id": 16,
  "title": "Post-Budget Perspectives: Voices That Define the Financial Landscape",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/02/iStock-1138179078-400x299.jpg",
  "excerpt": "Anshuman Das, CEO and Co-founder, Careernet “As we witness the unprecedented pace of infrastructure development in all facets—be it digital, social, or physical—it is evident that",
  "link": "https://economictimes.indiatimes.com/jobs/mid-career/experiencing-a-career-rut-experts-suggest-a-4-step-process-to-break-through-it/articleshow/106508326.cms",
  "desc": [
      "We all experience what is called a career rut at some point in our professional journey. This situation can last for an extended period and cause losses in personal and professional spheres.",
      "So the first step to dealing with a career rut is recognising and accepting it, and then strategically taking the necessary measures to overcome the situation. But how do you identify a career rut, how can it impact an individual and how can one get rid of it?",
      "Neelabh Shukla, Chief Business Officer, Careernet, a talent solutions provider, defines a career rut as a feeling similar to experiencing a prolonged state of monotony and reduced productivity. Elaborating on the reasons for a decline in motivation, he says that insufficient recognition of achievements, limited opportunities for career growth, the monotony of repetitive tasks and hindering engagement are a few factors that contribute to this downturn."
  ]
},
{
  "id": 17,
  "title": "Interim budget 2024 focuses on youth empowerment and innovation Industry",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/02/Interim-budget-2024-400x299.webp",
  "excerpt": "The Finance and Corporate Affairs Minister Nirmala Sitharaman, while presenting the Interim Union Budget for 2024-2025 in Parliament today emphasized improving people’s capability and empowering them",
  "link": "https://economictimes.indiatimes.com/jobs/fresher/work-culture-brand-name-or-pay-cheque-what-should-matter-more-to-early-career-professionals/articleshow/105290754.cms",
  "desc": [
      "Salary, corporate brand and work culture often push individuals towards accepting or rejecting job offers. But how should early career professionals, especially someone just starting out, choose the best company possible while starting their careers?",
      "Let’s closely weigh the three factors — work culture, pay and brand image — against each other while answering this question.",
      "What matters on your resume more. Anshuman Das, CEO and Co-Founder of talent solutions provider Careernet, says brand name and high pay are valuable aspects but they serve different purposes. While a brand name brings credibility and signifies that an individual has met certain standards and gained valuable experience, high pay serves as a value indicator of the professional and helps them negotiate higher compensation later.",
      "Accepting low pay = delay in growth opportunities? In Das’s opinion, settling for low pay in the initial years of your career can have short-term as well as long-term implications — such as financial strain, delayed savings, lower baseline for future negotiations, and job dissatisfaction some years down the line. But employees can mitigate the long-term effects of this decision by following certain strategies around skill development, mentorship opportunities, improving financial literacy, and actively exploring avenues for career advancement. “While an initial low pay poses challenges, it doesn’t delay growth opportunities. One’s career path is dynamic and can be influenced by efforts, skills and determination,” says Das."
  ]
},
{
  "id": 18,
  "title": "Budget 2024: HR leaders rally for tax incentives and skill development focus",
  "link": "https://www.moneycontrol.com/news/trends/weather/decoding-how-a-climate-career-in-india-looks-like-11548921.html",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/02/98614792-400x299.webp",
  "excerpt": "As the interim budget 2024 is just one day away, human resource leaders want the government to prioritise the HRTech segment. Industry captains voiced their hopes […]",
  "desc": [
      "The scope of careers related to climate in India is rapidly expanding, driven by the urgent need to address climate change and its profound impact on the environment, economy, and society.",
      "But what does a career in climate look like? What kind of job profiles are most popular and, more importantly, how much do they pay?",
      "Whether it’s in the field of renewable energy, environmental policy, sustainable agriculture or climate research, individuals pursuing climate careers in India have a significant opportunity to make a positive impact while contributing to a greener and more resilient future for the nation and indeed, the planet.",
      "From talent solution provider Careernet’s internal job postings, job search portals and company websites, it has been observed that around 15 percent of job postings now ask for green skills in India. Green job opportunities in September 2023 saw a 23 percent year-on-year (YoY) growth. It is important to note that there are over 3.5 lakh open positions requiring these skills across industries now. According to Neelabh Shukla, chief business officer of Careernet, candidates can expect an average minimum salary of Rs 7 lakh per annum (LPA) for a fresher. For mid to senior roles, one can expect a salary in the starting range of Rs 13.5 LPA."
  ]
},
{
  "id": 19,
  "title": "The making of a chief strategy officer: Traits, skills and abilities",
  "link": "https://economictimes.indiatimes.com/jobs/hr-policies-trends/amid-layoffs-heres-how-outplacement-solutions-are-helping-employees/articleshow/103628718.cms",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/shutterstock_2017841906-400x299.jpg",
  "excerpt": "The role of the chief strategy officer (CSO) is to set and steer the firm’s strategy. The CSO plays a pivotal, cross-functional role within the company, […]",
  "desc": [
      "After layoffs, as employees are doing their best to find jobs, what are companies doing to ease this process? Enter outplacement solutions.",
      "Anshuman Das, CEO at Careernet, a talent solutions provider that has also been working with organisations to provide support in outplacement solutions, says as large, traditional companies grow and look at new strategic directions, they might find some employees’ skills are not completely aligned with the new goals. “We call this the skills-fade-out situation. In these cases, outplacement is offered as a solution to help employees assess their strengths, provide a deeper discovery about themselves, arm them with interview tips, understand the new emerging opportunities, and then to help them prepare for the shifts,” he says.",
      "However, Das explains that the concept of outplacement is consumed in a different way in the new-age knowledge-based industry. “People here are already aware of the opportunities. In a lot of cases, it’s just about connecting them with new opportunities,” he says."
  ]
},
{
  "id": 20,
  "title": "India Inc Enlists Military Veterans to Lead Crack Teams",
  "link": "https://www.rediff.com/getahead/report/7-ways-to-craft-a-perfect-cv/20230613.htm",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/Going-slow-Infosys-and-Wipro-keep-Class-of-2023-waiting-for-campus-hiring-400x299.jpg",
  "excerpt": "As the country celebrated the 75th Republic Day, an enduring image was the parade at Delhi’s Kartavya Path. Besides tableaus showcasing India’s rich cultural heritage, the […]",
  "desc": [
      "No matter what field you work in or what stage of your career you are in, metrics-based data always augments your CV, alerts Neelabh Shukla, Chief Business Officer, Careernet.",
      "In today’s job market, having a distinctive and well-crafted CV is essential to stand out from the competition and secure an interview. Whether you are a recent graduate or an experienced professional, your CV is your chance to make a great first impression on potential employers.",
      "It can make all the difference in getting your foot in the door and entering the fray for a new job."
  ]
},
{
  "id": 21,
  "title": "What will 2024 hold for layoffs in India?",
  "link": "https://www.moneycontrol.com/news/business/it-hiring-expected-to-be-grim-for-six-months-as-companies-wait-and-watch-10379151.html",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2024/01/Building-a-psychologically-safe-workplace-for-a-diverse-workforce-400x299.jpg",
  "excerpt": "Within the first three weeks of January 2024, more than 7,500 employees got laid off globally. It doesn’t bode well for India too. What will 2024 […]",
  "desc": [
      "Staffing experts expect the next six months – the first two quarters of FY24 – to be grim for IT hiring, which comes ahead of companies reporting their results for the final quarter of FY23 and the full year from next week. Hiring trends will be keenly watched, as net headcount additions are considered to be an indicator of demand amid a larger challenging macroeconomic climate.",
      "“IT companies, initially in the earlier quarter, had planned to warm up that they will start hiring. Because of the banking meltdown, and banking being a reasonably large portion for IT services, it is muted,” he says.",
      "Anshuman Das, the CEO of Careernet, said Q4 was muted due to the banking crisis, which scuttled plans that companies may have had."
  ]
},
{
  "id": 22,
  "title": "Cognizant: IT Industry Leader And A Leadership Poacher?",
  "link": "https://www.cnbctv18.com/education/layoffs-2023-are-layoffs-coming-next-for-mid-management-roles-here-is-what-experts-have-to-say-layoffs-meta-layoff-google-layoff-amazon-layoff-15990001.htm",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/1705777600_QHBxZv_cognizant_1_-400x299.jpg",
  "excerpt": "In 2023, the unexpected removal of ChatGPT CEO Sam Altman was a notable event in the business world, but the year ended on a positive note […]",
  "desc": [
      "As per Anshuman Das, CEO and Co-founder, Careernet in cost cutting measures non-revenue generating projects and non-performing teams or employees have to bear the brunt. While companies typically prioritise cutting costs in areas that are not contributing to the bottom line, they also consider laying off employees or letting go of projects that are not meeting performance expectations or do not align with the revised business plans any longer.",
      "“As a result, businesses are increasingly focusing on hiring hands-on managers. Managers are expected to act as individual contributors and also be hands-on rather than just being project managers or people managers,” said Das."
  ]
},
{
  "id": 23,
  "title": "Can non-poaching pacts fix high C-level attrition problem?",
  "link": "https://economictimes.indiatimes.com/tech/startups/tech-jobs-stability-wins-over-insane-pay-hikes/articleshow/97358166.cms?from=mdr",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/Can-non-poaching-pacts-400x299.jpg",
  "excerpt": "Many C-level executives switched sides and joined rival organisations in 2023. With talent in short supply, are companies now struggling to find replacements. Are non-poaching pacts […]",
  "desc": [
      "With almost all big technology companies announcing global layoffs one after the other, professionals in the sector in India are frantically looking for more secure options.",
      "The inflow of resumes from tech industry employees who have not received pink slips has at least doubled in the past one month or so, said executives at recruitment services providers and executive search firms. They included employees from companies such as Amazon, Google, Meta and Microsoft, which all have announced global layoffs.",
      "“Tech companies and startups went overboard on hiring in 2021 and 2022. During this rampant hiring spree, several of the processes were overlooked which impacted the hiring quality,” said Anshuman Das, cofounder of Careernet."
  ]
},
{
  "id": 24,
  "title": "Surge in demand for skilled electric vehicle talent as Indian manufacturers race to meet green mobility demands",
  "link": "https://thepeoplemanagement.com/outsourcing-recruitment-a-solution-to-fill-the-talent-supply-gap-anshuman-das-ceo-and-co-founder-careernet/",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2024/01/skilled-electric-vehicle-talent-as-Indian-manufacturers-race-400x299.jpg",
  "excerpt": "Demand for skilled electric vehicle talent is poised to reach an all-time high in 2024 as EV manufacturers race to meet the growing appetite for green […]",
  "desc": [
      "For many firms, the gap between demand and availability of talent is an expensive concern. Without a workforce equipped with the right skills, employees and organisations struggle to meet the operational requirements necessary for businesses to remain competitive. According to a NASSCOM report, ‘GCC India Landscape – 2021 & Beyond!’ today, nearly 25 per cent of Fortune 500 companies have set up Global Capability Centers (GCCs) in India – not just for operation-related roles but also for research and development roles. Given that this number is anticipated to increase in the coming years, India must actively develop its talent supply chains to maximise this growth potential.",
      "Recruitment Process Outsourcing (RPO) is a workforce solution that allows companies to outsource either a part or entire permanent recruitment activities to another firm. By working with an RPO provider, organisations stand to narrow the talent gap by simplifying the hiring process and management of employees.",
      "While outsourcing recruitment offers a wide range of benefits, here are a few that top the list:"
  ]
},
{
  "id": 25,
  "title": "IT Hiring To Remain Muted In Q3 And Q4 FY24",
  "link": "https://www.apnnews.com/72-of-participant-profiles-shortlisted-for-100-roles-during-the-4th-edition-of-careernet-career-fair-for-women/",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/IT-Hiring-To-Remain-Muted-In-Q3-And-Q4-FY24-400x299.jpg",
  "excerpt": "As the FY2024 is nearing an end, major Indian IT companies are gearing up to reveal their Q3 results from Thursday. It is anticipated that the […]",
  "desc": [
      "India’s leading talent solutions provider, Careernet, successfully organised Hitachi Presents Careernet Prism Career Fair for Women, Powered by Biocon and Co-powered by Sapiens, on August 27, 2022. The virtual event concluded with over 70% of participants being shortlisted for over 100+ roles in top-tier companies present including Hitachi, Biocon, Sapiens, Shell, Smith and Nephew, PubMatic and Solera.",
      "On hosting the third successful edition of the Career Fair for Women, Anshuman Das, CEO and co-founder of Careernet commented, “Some of the biggest challenges women face in their careers is a lack of opportunities to thrive. We are in the talent business, so the challenges of our talent should also be our business as well. We are happy to see another successful year of the women’s career fair and hope to have more opportunities to gather like-minded leaders and change advocates so we can build a stronger, more inclusive India Inc.“"
  ]
},
{
  "id": 26,
  "title": "What is a career rut and how to deal with it as an employee, employer",
  "link": "https://www.businesstoday.in/jobs/story/moonlighting-is-a-double-edged-sword-beware-of-legal-repercussions-345517-2022-08-24",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/workplace_1600_stress_ov-new-400x299.jpg",
  "excerpt": "Feeling stuck in a job with monotony and reduced productivity is like being trapped in a rut. It causes a feeling of resentment and disappointment in […]",
  "desc": [
      "‘Moonlighting’ can be a double-edged sword for employees in India, experts say. The practice of working on side jobs and part-time assignments while being employed full-time with an organisation may bring in some extra income and valuable experience, but when caught it may be seen as violation of contract and even lead to termination.",
      "“There is a lot of chatter about people moonlighting in the tech industry. This is cheating – plain and simple,” tweeted Wipro Executive Chairman Rishad Premji a few days ago.",
      "Careernet’s CEO and Co-founder Anshuman Das says the recent pandemic, an unstable job climate, the fears of a recession and attrition woes have sparked an industry-wide panic in the IT sector. “Given these circumstances, indications of moonlighting are definitely evident and it is emerging as a resort by remote employees seeking to secure income channels through any means.”"
  ]
},
{
  "id": 27,
  "title": "Specialised skills are killing it! MBA seen losing edge",
  "excerpt": "An MBA degree—regarded by many as a ticket to the corporate corridors—may just be losing its premium value in the job market. Several company",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/specialised-skills-are-killing-it-mba-seen-losing-edge-780x470-1-400x299.png",
  "link": "https://www.moneycontrol.com/news/technology/techies-with-generative-ai-skills-see-a-30-50-percent-jump-in-salaries-12638061.html",
  "desc": [
      "Techies in India are driving up salaries with additional AI, Generative AI and adjacent skills, commanding as high as 30-50 percent premium over those without such expertise, according to data from Careernet sourced by Moneycontrol.",
      "According to Careernet, professionals in GenAI can be bucketed into three large categories: GenAI technology developers, GenAI product developers and GenAI users.",
      "Those in the first category, who possess the necessary AI-related skills, command the highest premiums in salary hikes, compared to their counterparts lacking these skills.",
      "GenAI technology developers, who are engaged in developing GenAI technologies and frameworks, earn salaries starting from Rs 18 lakh per annum. Senior-level employees in this category can command salaries exceeding Rs 1 crore, putting them on par with global peers, data from Careernet showed.",
      "“They have made significant contributions to the advancement of AI through research, innovation, and thought leadership. These professionals generally have top tier education background, advanced education of masters, PhD and previous experience of research, patents, publications and so on in addition to skills required…” Neelabh Shukla, CBO, Careernet, told Moneycontrol."
  ]
},
{ 
  "id": 28,
  "title": "Experiencing a career rut? Experts suggest a 4-step process to break through it",
  "excerpt": "We all experience what is called a career rut at some point in our professional journey. This situation can last for an extended period and cause",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/Career-rut-400x299.jpg",
  "link": "https://economictimes.indiatimes.com/jobs/mid-career/is-that-promotion-elusive-here-are-some-ways-to-land-it/articleshow/107902570.cms/",
  "desc": [
    "We all experience what is called a career rut at some point in our professional journey. This situation can last for an extended period and cause frustration, lack of motivation, and a sense of stagnation in one's career.",
    "Breaking through a career rut requires self-reflection, proactive steps, and sometimes seeking external support or advice. Here are four steps suggested by experts to break through a career rut:",
    "Self-Assessment: Take time to reflect on your career goals, values, and interests. Assess where you currently stand in your career and identify areas for improvement or change.",
    "Setting Clear Goals: Define specific and achievable goals that align with your long-term career aspirations. Break down these goals into smaller, manageable tasks to stay focused and motivated.",
    "Skill Development: Invest in continuous learning and skill development to stay relevant in your industry. Identify areas where you can improve or acquire new skills that are in demand.",
    "Seeking Support: Don't hesitate to seek support from mentors, career coaches, or professional networks. Surround yourself with people who can provide guidance, encouragement, and constructive feedback." 
   ]
 },
 {
  "id": 29,
  "title": "India Inc Enlists Military Veterans to Lead Crack Teams",
  "excerpt": "As the country celebrated the 75th Republic Day, an enduring image was the parade at Delhi’s Kartavya Path. Besides tableaus showcasing India’s rich cultural heritage, the military might of the country’s armed",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/Going-slow-Infosys-and-Wipro-keep-Class-of-2023-waiting-for-campus-hiring-400x299.jpg",
  "link": "https://www.business-standard.com/india-news/amazon-to-ongc-india-inc-turns-to-military-veterans-to-cover-all-bases-124012500573_1.html",
  "desc": [
    "As the country celebrated the 75th Republic Day, an enduring image was the parade at Delhi’s Kartavya Path. Besides tableaus showcasing India’s rich cultural heritage, the military might of the country’s armed forces was on full display. And India Inc was paying close attention. Once retired, personnel from the defence forces, after all, make for ready talent. From cybersecurity to logistics and operations to human resources (HR), companies such as Amazon India, Tata Motors, ONGC, EverEnviro and Vishwa Samudra group are already bolstering their ranks with former army personnel. While numbers are hard to come by, anecdotal evidence suggests that corporate India is enlisting more and more military veterans (MVs).",
    "“Effort is often required to rebrand or contextualise military experience to emphasise the relevance of acquired skills in a manner that resonates with civilian employers,” says Delshad Master, who retired as squadron leader and is now associate vice-president, Careernet Prism, which focuses on diversity, equity and inclusion (DEI) hiring. Master, who spent a decade with the Indian Air Force training pilots and airmen at forward air bases, says while veterans undergo transition programmes to adapt to civilian life, companies need to sensitise and educate their civilian workforce by addressing biases and misconceptions about veterans."
  ]
},
{
  "id": 30,
  "title": "After tepid 2023, tech & start-up hiring expected to improve in 2024",
  "excerpt": "After a rather subdued hiring environment in 2023 due to global macroeconomic factors, the two mainstays of Bengaluru’s white-collar job market – tech and start-ups – are expected to see a much better 2024, experts and analysts told DH.",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/01/deccanherald_2023-10_c4eab043-3041-49bf-a242-0a67efa461d1_jobs_employment_istock_1124626_1657197166-400x299.jpg",
  "link": "https://www.deccanherald.com/business/jobs-and-careers/after-tepid-2023-tech-start-up-hiring-expected-to-improve-in-2024-2830905",
  "desc": [
    "After a rather subdued hiring environment in 2023 due to global macroeconomic factors, the two mainstays of Bengaluru’s white-collar job market – tech and start-ups – are expected to see a much better 2024, experts and analysts told DH.",
    "Traditional IT services firms – which account for a vast majority of talent intake in the sector – are expected to report a 10-20% growth in hiring numbers this year. And in the start-up space, experts believe the second half of 2024 may see an uptick in human resource intake as the economy recovers and funding increases.",
    "“Startup hiring may remain at similar levels during the first half of 2023, but H2 is when we expect it to pick up again. A lot of new companies working in sectors like health, AI and deep tech are expected to drive hiring,” said Anshuman Das, co-founder and chief executive officer of Careernet.",
    "Funding in the startup sector fell 65.8% in January-November 2023, which led to a 35-45% drop in hiring year-on-year. At the same time, layoffs went up 40% as more than 15,000 employees were laid off by roughly 100 Indian startups in 2023. Pay hikes when switching jobs stood at 25-65% in 2021, but that turned to pay cuts of up to -20% in 2023. Things may not start looking bright at the turn of the year, but a correction is expected to happen as it progresses.",
    "Das said that while early stage startups may offer lower packages, good talent is still moving there as they provide better prospects for growth than established startups with plateaued growth and higher risks of layoffs do."
  ]
},
{
  "id": 31,
  "title": "How flexi-staffing can offer stability in a volatile hiring environment",
  "excerpt": "Mass layoffs, decline in hiring, and delayed onboarding have triggered increased volatility in India’s employment landscape. This does not bode well for freshers trying to break",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/11/shutterstock_1917409868-400x299.jpg",
  "link": "https://economictimes.indiatimes.com/jobs/mid-career/how-flexi-staffing-can-offer-stability-in-a-volatile-hiring-environment/articleshow/105175753.cms",
  "desc": [
    "Mass layoffs, decline in hiring, and delayed onboarding have triggered increased volatility in India’s employment landscape. This does not bode well for freshers trying to break into the job market. Both white-collar and blue-collar hiring have significantly declined, with major repercussions for several industries like e-commerce, logistics, the IT and Technology sector, etc.",
    "IT services companies are anticipating reduced hiring in the short term due to an anticipated growth slowdown and a decreasing attrition rate. This trend is expected to continue for the next few quarters before stabilising at the long-term average of 13-15 percent."
  ]
},
{
  "id": 32,
  "title": "Salary hikes of major IT companies take a back seat amid weak demand",
  "excerpt": "Salary hikes at information technology (IT) companies have taken a back seat due to a slowdown in demand triggered by delayed decision-making by clients and reductions in discretionary spending.",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/10/Salary-hikes-of-major-IT-400x299.jpg",
  "link": "https://www.business-standard.com/companies/news/salary-hikes-of-major-it-companies-take-a-back-seat-amid-weak-demand-123101500288_1.html",
  "desc": [
    "Salary hikes at information technology (IT) companies have taken a back seat due to a slowdown in demand triggered by delayed decision-making by clients and reductions in discretionary spending. Some companies have deferred payments, while others have stalled them altogether.",
    "Human resources (HR) experts said salary hikes would be restrained this year due to a muted industry outlook and demand-supply issues.",
    "“Some companies might even choose not to give any hikes, while others may offer very minimal increments. This adjustment is a direct response to the prevailing supply and demand dynamics. In 2021-22, companies responded to high talent demand by offering substantially higher salary increments, which are now being streamlined,” said Anshuman Das, chief executive officer (CEO) and co-founder of leading recruitment firm Careernet."
  ]
},
{
  "id": 33,
  "title": "How Inclusive Is India Inc.?",
  "excerpt": "Companies have the intent to hire people with varied sexual orientations, physical disabilities, and neuro diversities. However, only the top firms are walking the talk.",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/08/workplace-diversity-1-400x299.jpg",
  "link": "https://www.fortuneindia.com/long-reads/how-inclusive-is-india-inc/113599",
  "desc": [
    "Companies have the intent to hire people with varied sexual orientations, physical disabilities, and neuro diversities. However, only the top firms are walking the talk. A diverse workforce that represents people with varied sexual orientations, diverse races, ethnicities and those with disabilities is a must-have according to the United Nations’ sustainable development goals (SDG). Though India Inc. is still a while away from embracing diversity in the true sense of the term, companies have started taking baby steps.",
    "According to human resources solutions firm Careernet, though 70% of Indian employers have the intent to have at least 3-5% of their employees from the LGBTQ community, only 1.5-2% companies managed to successfully recruit LGBTQ talent last year. Though more than 65% companies have a clearly stated policy to include people with disabilities, less than 25% of office spaces are ‘disabled friendly’. Also, close to 60% of PWD (people with disabilities) hires are made at the entry- and middle-management levels. Very few make it to senior leadership roles.",
    "Most organisations prefer hiring only people with locomotor disabilities, and are not ready to absorb those who are visually handicapped or even those with speech and hearing impairment, says S. Pasupathi, COO, Careernet. “In case of locomotive disability, they don’t have to invest too much as most buildings by and large are locomotive-disability friendly. They have ramps and wheel-chairs available. For visual disabilities, they have to invest in braille-enabled software. In case of the hearing impaired, they have to invest in training their workforce to communicate in sign languages. Firms look at these as additional costs, not investments,” he adds."
  ]
},
{
  "id": 34,
  "title": "Indian unicorns cut back on employee appraisals as cost-cutting takes priority",
  "excerpt": "A majority of over 100 unicorns in India have slashed appraisal budgets for 2023 as the startups increasingly look to cut costs while grappling with a prolonged funding winter amid deteriorating macroeconomic headwinds.",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/workplace-740x387-1-400x299.jpg",
  "link": "https://www.moneycontrol.com/news/business/startup/indian-unicorns-cut-back-on-employee-appraisals-as-cost-cutting-takes-priority-10756791.html",
  "desc": [
    "A majority of over 100 unicorns in India have slashed appraisal budgets for 2023 as the startups increasingly look to cut costs while grappling with a prolonged funding winter amid deteriorating macroeconomic headwinds.",
    "The trend comes as a contrast to 2021, when startups hired aggressively amid immense investor interest and multiple fundraising rounds. With the funding pipeline running down, the tide has turned and tech startups are now racing to become profitable by cutting down the excess.",
    "Anshuman Das, CEO of Careernet, told Moneycontrol that while layoffs have helped reduce expenses to an extent, the focus on frugality will affect hikes and bonuses this year.",
    "“Last year startups were giving dramatically high hikes in the range of 20-30 percent. That will come down to almost singular digits. Companies are trying to rationalise their budgets… with layoffs. These very low to moderate hikes and bonuses have also been very stressed out,” Das added."
  ]
},
{
  "id": 36,
  "title": "Green Jobs Set To Surge",
  "excerpt": "Green jobs refer to employment opportunities in industries and sectors that focus on environmental sustainability and preserving natural resources.",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/04/Green_1680597942-400x299.webp",
  "link": "https://planet.outlookindia.com/opinions/green-jobs-set-to-surge-news-415002",
  "desc": [
    "Green jobs refer to employment opportunities in industries and sectors that focus on environmental sustainability and preserving natural resources. India has been actively supporting green growth in recent years as the government seeks to decrease its carbon footprint and migrate to renewable energy sources with the goal of fostering sustainable economic development. To achieve these targets, the Indian government has implemented several policies and initiatives, including the National Solar Mission, the Energy Conservation Building Code, the National Green Hydrogen Mission, and the Swachh Bharat Mission. These initiatives aim to promote the use of clean energy, reduce energy consumption and waste, and promote sustainable practices in various sectors.",
    "It is expected to create numerous job opportunities in India, particularly in the renewable energy, green/clean transport, and sustainable development sectors. The Green Hydrogen Mission alone, for example, is expected to create over six lakh jobs by 2030. These jobs offer a unique opportunity for individuals to build successful careers while making a positive impact on the environment."
  ]
},
{
  "id": 37,
  "title": "Bad news awaiting tech grads entering the job market",
  "excerpt": "Technology companies are likely to hire engineering graduates at the previous year’s levels of ₹2-4 lakh per annum, industry experts said, adding they expect no increase in freshers’ pay this year as hiring winds down after a year of aggressive recruitment.",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/tech-grads-may-have-to-settle-for-2-4-lakh-pay-400x299.webp",
  "link": "https://www.livemint.com/news/india/tech-grads-may-have-to-settle-for-2-4-lakh-pay-11676570487199.html",
  "desc": [
    "Technology companies are likely to hire engineering graduates at the previous year’s levels of ₹2-4 lakh per annum, industry experts said, adding they expect no increase in freshers’ pay this year as hiring winds down after a year of aggressive recruitment.",
    "“IT firms, including large services companies, will see at least 40% drop in fresher hiring target for this year. In such cases, there will be no need for a salary hike. We expect large IT services firms to offer salaries of 3.18-4 lakh for entry-level campus hires,” said Anshuman Das, chief executive and co-founder of Careernet, a talent solutions provider."
  ]
},
{
  "id": 39,
  "title": "IIT PLACEMENTS: WHEN HARD WORK DOESN’T PAY",
  "excerpt": "During the IIT placement season, which begins every year on 1 December and sometimes goes up to April, students from the computer science batch are wooed by many suitors, followed by those from electronics, electrical and the like. Civil engineering isn’t too hot.",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/01/LSpic_1674583707171_1674583727380_1674583727380-400x299.webp",
  "link": "https://www.livemint.com/news/india/iit-placements-when-hard-work-doesn-t-pay-11674583123259.html",
  "desc": [
    "During the IIT placement season, which begins every year on 1 December and sometimes goes up to April, students from the computer science batch are wooed by many suitors, followed by those from electronics, electrical and the like. Civil engineering isn’t too hot.",
    "The kind of IIT that the student graduates hail from is also a factor. India has 23 IITs, with the newest ones being IIT Palakkad (Kerala), IIT Dharwad (Karnataka), IIT Jammu and IIT Goa.",
    "“There is a very broad salary spectrum for fresh graduates at IITs, which is very much in line with how salaries behave in the new age/tech and R&D driven Industries. The compensation/CTC at IITs can vary from ₹8 lakh to ₹80 lakh per annum. There are a lot of top-notch employers hiring the best talent from IITs. And yet, they are not the ones paying the highest salary,” said Anshuman Das, chief executive officer and co-founder of Careernet, a talent solutions provider. Careernet has a team that tracks IIT salaries."
  ]
},
{
  "id": 40,
  "title": "How flexi-staffing can offer stability in a volatile hiring environment",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/11/shutterstock_1917409868-400x299.jpg",
  "link": "https://www.cnbctv18.com/education/career-cushioning-replaces-quiet-quitting-as-the-new-workplace-trend-15402881.htm",
  "excerpt": "Mass layoffs, decline in hiring, and delayed onboarding have triggered increased volatility in India’s employment landscape. This does not bode well for freshers trying to break […]",
  "desc": [
    "Move over from ‘quiet quitting’. Increasing layoffs and job insecurity has given prominence to ‘career cushioning’, which loosely translates as employees being ready with a plan B. This time, the workplace has borrowed this trend from the dating industry. In romantic relationships, cushioning is a strategy to soften the blow of a breakup. In the workplace culture, it means to leave your options open and take steps to ‘cushion the landing’ if anything unexpected happens.",
    "Anshuman Das, CEO and Co-Founder of Careernet, suggests that employees should keep the right balance between high-growth and stable career opportunities. High growth does not assure stability, and when the job market is seeing attrition, such an industry will be targeted first."
  ]
},
{
    "id": 41,
    "title": "Tech layoffs: Why program managers and CXOs are still out in the cold and jobless",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/11/Jobs-urban_shutterstock_728813566-770x433-1-400x299.jpg",
    "link": "http://bweducation.businessworld.in/article/72-Of-Participant-Profiles-Shortlisted-In-Career-Fair-For-Women/04-10-2022-449182/",
    "excerpt": "Many techies, especially those in program manager roles, have been finding it tougher to find job opportunities as their functions are getting replaced or transitioning, which […]",
    "desc": [
      "India’s talent solutions provider, Careernet, organised Hitachi Presents Careernet Prism Career Fair for Women, Powered by Biocon and Co-powered by Sapiens, on August 27, 2022. The virtual event concluded with over 70 per cent of participants being shortlisted for over 100 roles in companies present including Hitachi, Biocon, Sapiens, Shell, Smith and Nephew, PubMatic and Solera.",
      "Organised by Careernet Prism, an offering that helps employers build inclusive workplaces with diverse talent from among Women (including back to work programmes), People across regions and ethnicity, Persons with Disabilities (PwD), LGBTQ+ and Veterans, the event attracted over 1800 registrants.",
      "The participants interviewed and got hired for roles such as AWS Developers, cloud engineering, data scientist, software engineering, QA automation engineering, big data analyst, full stack developers and others by employers with offices across Pune, Bengaluru, Gurugram, Delhi and Hyderabad."
    ]
},
{
  "id": 42,
  "title": "Leaders look to address the generational gap among employees as return-to-office mandate kicks in",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/11/work-from-office-400x299.jpg",
  "link": "https://www.financialexpress.com/industry/short-term-demand-for-digital-talent-dips-as-global-economy-slows-funding-dries-up/2640244/",
  "excerpt": "Working from the office, home or in the hybrid mode — leaders at various organisations have for months been pondering over the best choice for their […]",
  "desc": [
    "Typically, four sets of companies are looking for digital talent – digital natives or startups, IT services companies, global capability centres (GCCs), and traditional companies that are moving online.",
    "“There has been a 60-70% dip in hiring among the digital natives as much of their growth was driven by VCs instead of a strong balance sheet. IT services companies and GCCs have also been impacted due to the slowdown in the US economy and we see a 30-40% dip in hiring demand for digital talent. In traditional companies like Reliance and Tatas, hiring continues albeit at a slow pace,” said Anshuman Das, cofounder and CEO of Careernet."
  ]
},
{
  "id": 43,
  "title": "Is Narayana Murthy’s 70-hour work week a fair ask?",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/11/Narayanaswami-400x299.jpg",
  "link": "https://timesascent.com/articles/how-women-are-reshaping-male-dominated-tech-industries-in-india-inc-/158513",
  "excerpt": "Narayana Murthy joined the list of tech leaders Elon Musk and Jack Ma who want workers to commit long working hours. It’s in contrast to India’s […]",
  "desc": [
    "Techies in India are driving up salaries with additional AI, Generative AI and adjacent skills, commanding as high as 30-50 percent premium over those without such expertise, according to data from Careernet sourced by Moneycontrol.",
    "According to Careernet, professionals in GenAI can be bucketed into three large categories: GenAI technology developers, GenAI product developers and GenAI users.",
    "Those in the first category, who possess the necessary AI-related skills, command the highest premiums in salary hikes, compared to their counterparts lacking these skills.",
    "GenAI technology developers, who are engaged in developing GenAI technologies and frameworks, earn salaries starting from Rs 18 lakh per annum. Senior-level employees in this category can command salaries exceeding Rs 1 crore, putting them on par with global peers, data from Careernet showed.",
    "“They have made significant contributions to the advancement of AI through research, innovation, and thought leadership. These professionals generally have top tier education background, advanced education of masters, PhD and previous experience of research, patents, publications and so on in addition to skills required…” Neelabh Shukla, CBO, Careernet, told Moneycontrol."
  ]
},
{
  "id": 44,
  "title": "Bye home!: End of remote work era as tech companies make work from office mandatory",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/11/End-of-remote-work-era-as-tech-companies-make-work-from-office-mandatory-400x299.jpg",
  "link": "https://www.indiatoday.in/india-today-insight/story/jobs-spurt-in-indias-sunrise-sectors-but-wheres-the-talent-2504212-2024-02-19",
  "excerpt": "During the pandemic, work from home (WFH) had become the norm and when Covid restrictions eased over the years, IT companies and start-ups have been brainstorming […]",
  "desc": [
    "A world marked by rapid technological changes is also fast transforming the skills required in jobs, making it difficult for employers to find suitable talent.",
    "Anshuman Das, CEO and co-founder of talent solutions provider Careernet, says companies will have to go beyond compensation benefits to address the talent gap. Proactive measures, such as partnering with educational institutions for continued research and innovation, robust training initiatives, and mentoring and nurturing talent, will be essential to upskill and retain the workforce."
  ]
},
{
  "id": 45,
  "title": "Quitting right after promotion? Here’s what you should know",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/10/Resignatiaon-400x299.jpg",
  "link": "https://www.business-standard.com/amp/shows/the-morning-show/what-will-2024-hold-for-layoffs-in-india-3683.htm",
  "excerpt": "A friend recently told me something that I found absolutely strange: Her colleague decided to quit his job right after getting promoted to a position that […]",
  "desc": [
    "Within the first three weeks of January 2024, more than 7,500 employees got laid off globally. It doesn’t bode well for India too. What will 2024 hold for layoffs in India?"
  ]
},
{
  "id": 46,
  "title": "Tech jobs moving beyond IT firms",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/10/Tech-jobs-moving-beyond-IT-firms-400x299.jpg",
  "link": "https://www.newindianexpress.com/business/2024/jan/01/with-ai-in-focus-hiring-landscape-set-for-growth-in-2024-2646700.html",
  "excerpt": "Most companies in India today, in whichever sphere they operate, are beefing up their IT capabilities. Banks have been compelled to do so as customers prefer […]",
  "desc": [
    "The country’s hiring landscape is set for growth despite many challenges it faced in 2023. From BFSI, e-commerce, consulting to healthcare and analytics and data, many sectors show a significant hiring intent in 2024.",
    "Experts say though top IT companies are on hiring freeze, they will give preference to skill-based hiring such as AI/ML, cloud computing, cyber security and DevOps roles.",
    "“Campus hiring is currently down to 15%, with a 25% overall decline predicted in 2024. 2023 has been a dull year due to an economic slowdown which has reduced attrition, but it has also stalled headcount growth in the sector. Additionally, a slowdown in overall increment has influenced hiring dynamics in the IT industry,” said Anshuman Das, CEO and Co-Founder, Careernet."
  ]
},
{
  "id": 47,
  "title": "Is there light at the end of the tunnel for tech sector workers?",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/10/Is-there-light-at-the-end-of-the-tunnel-for-tech-sector-workers-400x299.jpg",
  "link": "https://www.moneycontrol.com/news/business/tech-layoffs-why-program-managers-and-cxos-are-still-out-in-the-cold-and-jobless-11712491.html",
  "excerpt": "Tech giants have given campus hiring a miss. Experts say there may be a 65% drop in recruitment of tech freshers this fiscal. Find out when [...]",
  "desc": [
    "Many techies, especially those in program manager roles, have been finding it tougher to find job opportunities as their functions are getting replaced or transitioning, which requires additional or a different set of skills. This is a part of the wider layoffs in the tech industry. In 2022, over 1,000 tech companies laid off over 150,000 employees.",
    "This comes after tech companies saw a blockbuster year in terms of venture capital in CY 2021 and 2022, which led to inflated salaries, higher attrition, hyper-growth and a battle to hire and retain better talent, which eventually became a jobseeker’s market.",
    "“If the startups were cautious about the liquidity in the market, we could have avoided this situation. Some hired five times more than they could actually afford, assuming that the liquidity in the market would remain constant. Also, many sectors misjudged the situation and expected everything to move online, which eventually did not happen,” said Anshuman Das, co-founder and CEO of staffing and recruitment firm Careernet. “This time, the frenzy we saw in the tech sector was very high. In the earlier downturns, the tech industry was small, so this kind of tech meltdown was unprecedented.”"
  ]
},
{
  "id": 48,
  "title": "Decoding how a climate career in India looks like",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/10/shutterstock_274566236-770x433-1-400x299.jpg",
  "link": "https://www.deccanherald.com/education/gender-pay-gap-its-real-2719145",
  "excerpt": "The scope of careers related to climate in India is rapidly expanding, driven by the urgent need to address climate change and its profound impact on [...]",
  "desc": [
    "Over the last four decades, India has seen low levels of women’s labour force participation, with gaps of nearly 40 per cent between the proportions of men and women in the labour force. Covid-19-induced lock-downs had a significant impact on the global economy. It greatly affected the labour market, with many businesses implementing pay freezes and rising unemployment, economic inactivity, and redundancies.",
    "One of the main consequences is exacerbating pre-existing inequalities, particularly those related to gender. Women’s employment has suffered disproportionately, resulting in women being furloughed or losing their jobs, especially those who work in sectors hit hardest by the economic downturn."
  ]
},
{
  "id": 49,
  "title": "Salary hikes of major IT companies take a back seat amid weak demand",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/10/Salary-hikes-of-major-IT-400x299.jpg",
  "link": "https://the-ken.com/story/byjus-on-your-resume-recruiters-say-no-chance/",
  "excerpt": "Salary hikes at information technology (IT) companies have taken a back seat due to a slowdown in demand triggered by delayed decision-making by clients and reductions [...]",
  "desc": [
    "The edtech sector has seen thousands of layoffs after it miscalculated its growth trajectory in the pandemic-led haze. Even startups in other segments have been impacted as the funding tap dried up. But Byju’s employees have it worse. Job insecurity looms like a constant threat. Despite this, they can’t just quit because the opportunities outside are scarce. Those who manage to get a job may have to take a sharp pay cut. And the recruiters are very cognisant of this. It’s not a great time to be in the job market, given the current low demand in this space."
  ]
},
{
  "id": 50,
  "title": "Gender Pay Gap: It’s Real",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/10/Gender-Pay-Gap-Its-Real-400x299.jpg",
  "link": "https://www.deccanherald.com/business/business-news/bengaluru-to-lead-ev-job-spike-to-5-million-by-2030-report-1225751.html",
  "excerpt": "Over the last four decades, India has seen low levels of women’s labour force participation, with gaps of nearly 40 per cent between the proportions of [...]",
  "desc": [
    "India’s ambitious journey to become a top player in the emerging electric vehicle market will be accompanied by 5 million new direct job opportunities, as per a report by talent solutions provider Careernet. The burgeoning market has already witnessed a 2,218 per cent surge in sales in the past three years.",
    "EV jobs saw a compound annual growth rate of 110 per cent between 2020 and 2022. Last calendar year clocked 0.4 million EV jobs, 28 per cent of which were in Bengaluru. The city is expected to become a hub for both manufacturing and innovation in the sector as it goes through a technology intensive transformation, according to Careernet chief executive Neelabh Shukla."
  ]
},
{
  "id": 51,
  "title": "Has ‘work from home’ reached its end?",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/10/8C29E2C3-C56C-40AC-BC8C-BB5E1FB66CBA-400x299.jpeg",
  "link": "https://timesofindia.indiatimes.com/blogs/voices/building-a-psychologically-safe-workplace-for-a-diverse-workforce/",
  "excerpt": "As companies are trying to woo people back to the office, it has become hard for many employees to let go of the new found flexibility [...]",
  "desc": [
    "In today’s globalised world, diversity has become a major concern for organisations. A diverse workforce can bring a variety of perspectives, ideas, and experiences that can drive innovation and creativity. However, diversity alone is not enough to achieve organisational success. Creating a psychologically safe workplace that meets the needs of a diverse workforce is essential for promoting innovation, creativity, and productivity. Psychological safety at a workplace is crucial due to its importance for agility, diversity and inclusion, and remote working.",
    "A psychologically safe workplace is one where employees feel free to share their thoughts, ideas, and concerns without fear of reprisal. It is a workplace where employees feel respected, valued, and heard, regardless of their gender, ethnicity, age, or any other personal characteristics. Psychological safety at work does not imply that everyone is always cordial. When employees know that their leaders encourage honesty, candour, and truth-telling and that their teammates will support one another, they are free to “brainstorm out loud,” give feedback, and work through conflicts together. Employees feel free to take risks and make mistakes, without fear of being punished or judged."
  ]
},
{
  "id": 52,
  "title": "Indian IT Sector Witnesses Softening Demand, Raises Concerns About Hiring",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_289/https://careernet.in/wp-content/uploads/2023/10/1696687122_INiF5F_jobs-400x289.png",
  "link": "https://www.youtube.com/watch?v=bTnPFyrA2lw",
  "excerpt": "Propelled by digital transformation India is emerging as a global hub for technology and innovation, with its IT sector playing a pivotal role. But despite the [...]",
  "desc": [
    "Mark Zuckerberg says this is a year of efficiency. Yahoo says it will slash 20 percent workforce. Disney slashes 7,000 jobs. The list is too long to be ready so we have put out the numbers on your screen. How deep this pain is? how long it will last and what’s the way forward? What happens to these tech workers who are being laid off? At the same time – why are these tech firms forced to slash jobs in such numbers? Are they chasing profitability at the cost of their employees? Or was it simply inevitable as the Fed embarked on a rate hike spree? To take on all these questions that are brewing in our heads about the incessant layoffs, ET NOW’s Vikram Oza speaks with Aditya Narayan Mishra of Ciel HR Services; Anshuman Das of Careernet Consulting & Omkar Tanksale of Axis Securities. Tune into this edition of India Tonight."
  ]
},
{
  "id": 53,
  "title": "Careernet’s virtual All Diversity Career Fair concludes with around 1,000 participants",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/09/Roadblock-banner-400x299.png",
  "link": "https://www.moneycontrol.com/news/business/tcs-infosys-wipro-hcltech-net-employees-addition-drops-93-in-q3fy23-9886051.html",
  "excerpt": "Careernet Prism concluded the 5th edition of India’s largest virtual ‘All Diversity Career Fair’. The event witnessed the participation of around 1,000 individuals from the LGBTQIA+ [...]",
  "desc": [
    "India’s top four IT companies hired 1,940 employees on a net basis in the third quarter of FY23, down 93 percent from the previous quarter.",
    "The net addition by Tata Consultancy Services, Infosys, Wipro, and HCLTech had fallen 45 percent to 28,836 employees in the second quarter from the first quarter, when 52,842 employees were recruited.",
    "The declining trend in headcount addition comes as the IT sector faces a cautionary demand environment, a challenging environment in certain verticals in major markets such as North America and Europe, and a slowdown in discretionary spends. Although a slowing hiring trend is often considered an indicator of easing demand, top executives of IT companies maintained this is not the case.",
    "Anshuman Das, CEO of Careernet, expects campus hiring in calendar 2023 to be hit as companies honour offers they have already made.",
    "“A lot of the company’s campus hiring plans are reasonably muted, 50-60 percent down from last year’s number,” he said."
  ]
},
{
  "id": 54,
  "title": "Career fair to host jobs for armed force veterans",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/09/1-262-400x299.jpg",
  "link": "https://www.business-standard.com/article/companies/layoff-fallout-outplacement-firms-have-their-hands-full-with-flood-of-cvs-122121200871_1.html",
  "excerpt": "Veterans of the Indian Armed Forces seeking to transition to civilian careers following their military service are being offered jobs by Careernet Prism. This is the [...]",
  "desc": [
    "“We have seen an uptick of about 20-25 per cent in direct job applications and the referral scheme programme on the website, which allows people to refer their friends who have been impacted by the layoffs,” says Anshuman Das, CEO and co-founder of Careernet.",
    "To build morale and help recruits work on their technical skills, these portals are now spearheading newer initiatives. For instance, Shine.com has been conducting coding hackathons where candidates can showcase their skills and get noticed by potential employers.",
    "Careernet has been hosting practice exams on its coding website that job seekers can take to see where they stand and polish their skills. The portal is also helping tweak resumes to better suit the demands of the current job market; assisting in interview preparation; and guiding recruits to position themselves more effectively."
  ]
},
{
  "id": 55,
  "title": "Hiring in tech sector expected to pick up early next year: Experts",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/09/hiring-job-work-employment-job-shut-400x299.jpg",
  "link": "https://www.cnbctv18.com/education/pregnancy-to-prejudice-biases-haunt-the-indian-workplace--whats-the-way-out-14951231.htm",
  "excerpt": "The Q1 and Q2 of the calendar year 2023 (January–June) witnessed the most significant impact on hiring in the tech sector in India. Many organisations implemented [...]",
  "desc": [
    "Another common bias prevalent in the workplace is the ‘unconscious bias,’ which has an impact on whether certain individuals get hired or not. Unconscious biases occur outside our control and are triggered by our brain making quick judgements and assessments of people and situations that are influenced by our background, cultural environment, and personal experiences, said Anshuman Das, CEO & Co-Founder, Careernet.",
    "“These unconscious prejudices can be detrimental to a team. If leadership is influenced by unchecked unconscious prejudices, these could result in unjust treatment or disadvantages for most employees,” added Das."
  ]
},
{
  "id": 56,
  "title": "Why the ‘IT jobs’ halo is fading even among second-tier colleges",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/09/IT-jobs-400x299.jpg",
  "link": "https://www.theweek.in/news/biz-tech/2022/07/21/will-indian-it-services-segment-face-growth-pangs-in-near-term.html",
  "excerpt": "The $245-billion IT services outsourcing industry, India’s largest white-collar recruiter, is one of the biggest success stories to emerge from India. It typically absorbs 20-25 per...",
  "desc": [
    "Recently Rishad Premji, the Wipro chairman, said that the technology services industry, at some level, is recession proof. Will it really remain recession proof? Indian IT services companies have of course enjoyed constant growth in the last couple of years especially during the Covid-19 pandemic. For many IT services firms, digital revenue increased by around 25 per cent in FY22. As per rating agency CRISIL, the IT services will log double-digit revenue growth this fiscal, at 12-13 percent, driven by digitalisation, strong demand for new-age technologies and depreciation in the Indian rupee. However this will be in contrast to the 19 per cent growth that was achieved in the last fiscal by the segment. This will be the highest fall in the past eight years.",
    "Experts with whom THE WEEK spoke to feel that there are challenges and opportunities for the sector in the coming year but the growth rate will be affected. Indian IT services sector has been a beneficiary of the Covid fall out and associated surge in technology investments. While the sector witnessed a significant growth coupled with enhanced profits, technology employee attrition during the last 18 months made deliveries difficult denting growth aspirations of the sector. World economic situation and the continuing uncertainty in Europe will haunt the sector with new customer acquisition not being easy while the renewals and maintenance contracts have seen margin pressures invariably,” remarked Subramanyam Sreenivasaiah, CEO at Ascent HR."
  ]
},
{
  "id": 57,
  "title": "Amid layoffs, here’s how outplacement solutions are helping employees",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/09/Amid-layoffs-heres-how-outplacement-solutions-are-helping-employees-400x299.jpg",
  "excerpt": "After layoffs, as employees are doing their best to find jobs, what are companies doing to ease this process? Enter outplacement solutions. Anshuman Das, CEO at...",
  "link": "https://www.moneycontrol.com/news/technology/techies-with-generative-ai-skills-see-a-30-50-percent-jump-in-salaries-12638061.html",
  "desc": [
    "After layoffs, companies are focusing on helping employees find new jobs.",
    "Outplacement solutions are playing a crucial role in easing the transition for employees.",
    "Anshuman Das, CEO at Careernet, discusses the importance of outplacement solutions in the current job market."
  ]
},
{
  "id": 58,
  "title": "How Inclusive Is India Inc.?",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/08/workplace-diversity-1-400x299.jpg",
  "excerpt": "Companies have the intent to hire people with varied sexual orientations, physical disabilities, and neuro diversities. However, only the top firms are walking the talk. A...",
  "link": "https://www.businessworld.in/article/Cognizant-IT-Industry-Leader-And-A-Leadership-Poacher-/22-01-2024-507080/",
  "desc": [
    "The Indian corporate sector aims to hire individuals from diverse backgrounds.",
    "However, the implementation of inclusive policies is more prevalent among top-tier companies.",
    "Challenges remain in translating intent into action across all levels of the industry."
  ]
},
{
  "id": 59,
  "title": "A story by ‘The Ken’",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/08/shutterstock_2178995945-400x299.jpg",
  "excerpt": "The edtech sector has seen thousands of layoffs after it miscalculated its growth trajectory in the pandemic-led haze. Even startups in other segments have been impacted...",
  "link": "https://www.businessworld.in/article/Another-Washout-Year-/23-12-2023-503236/",
  "desc":[ "The edtech sector has seen thousands of layoffs after it miscalculated its growth trajectory in the pandemic-led haze. Even startups in other segments have been impacted."] 
},
{
  "id": 60,
  "title": "Matter of pride: Workplaces in India becoming friendly to LGBTQ+, says survey",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/07/shutterstock_1777379351-400x299.jpg",
  "excerpt": "India Inc’s efforts to foster diversity and inclusion in the workplace seem to be bearing fruit – slowly but surely. Even as Pride Month gets over...",
  "link": "https://economictimes.indiatimes.com/jobs/c-suite/leaders-look-to-bridge-the-gap-between-employee-generations-as-return-to-office-mandates-kick-in/articleshow/105116475.cms",
  "desc": ["India Inc’s efforts to foster diversity and inclusion in the workplace seem to be bearing fruit – slowly but surely. Even as Pride Month gets over..."]
},
{
  "id": 61,
  "title": "CVs of Byju’s employees flood job market: The Economic Times",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/07/looking-out-for-opportunities-in-india_-while-others-are-searching-for-roles_jobs_vacancy_employment_recruitment-1-400x299.jpg",
  "excerpt": "According to The Economic Times, almost half of Byju’s employees are seeking jobs elsewhere amid layoffs and financial troubles at the top edtech firm, but most...",
  "link": "https://www.business-standard.com/shows/the-morning-show/has-work-from-home-reached-its-end-3222.htm",
  "desc": ["According to The Economic Times, almost half of Byju’s employees are seeking jobs elsewhere amid layoffs and financial troubles at the top edtech firm, but most..."]
},
{
  "id": 62,
  "title": "Inside the mind of a firing manager: Guilt, shame and many questions",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/1497641670-009-400x299.jpg",
  "excerpt": "With investment taps turning dry and the global economy slowing, many companies in India have laid off people or declared their plans to do so. In...",
  "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/matter-of-pride-workplaces-in-india-becoming-friendly-to-lgbtq-says-survey/articleshow/101403644.cms",
  "desc": ["With investment taps turning dry and the global economy slowing, many companies in India have laid off people or declared their plans to do so. In..."]
},
{
  "id": 63,
  "title": "MSME Day 2023: How ‘flexi-hiring’ can improve talent access for MSMEs",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/people-4009327_1280-1-400x299.jpg",
  "excerpt": "Over the years, Micro, Small and Medium Enterprises (MSMEs) have emerged as a crucial part of India’s growth story, and talent plays a critical role in...",
  "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/matter-of-pride-workplaces-in-india-becoming-friendly-to-lgbtq-says-survey/articleshow/101403644.cms",
  "desc": ["Over the years, Micro, Small and Medium Enterprises (MSMEs) have emerged as a crucial part of India’s growth story, and talent plays a critical role in...",
           "Hiring has been put on the back burner at many companies in the last year. Startups, navigating funding winter and demand slowdown, are focused on cutting employee costs that skyrocketed in 2021.",
           "Over the years, the enduring allure of tech careers has attracted several aspirants to either stick to ‘the road mostly taken’ early on or switch their careers to move into it, at a later stage.",
           "“The motivation to invest in tech careers is often driven by the availability of open-source materials, the chance to gain reasonably good experience working on projects which can be created in isolation without being employed in a job, and the potential for higher pay,” said Anshuman Das, co-founder and CEO, Careernet, a talent solutions provider."
]
},
{
  "id": 64,
  "title": "Indian startup layoffs cross 25,000-mark as funding winter persists",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/Indian-startup-layoffs-cross-25000-1-400x299.jpg",
  "excerpt": "Layoffs by Indian startups, which started in the beginning of 2022, have crossed the 25,000-mark as more new-age tech companies take the cost-cutting route to survive...",
  "link": "https://punemirror.com/pune/others/pune-tops-in-giving-fair-share/cid1679258229.htm",
  "desc": ["Layoffs by Indian startups, which started in the beginning of 2022, have crossed the 25,000-mark as more new-age tech companies take the cost-cutting route to survive..."]
},
{
  "id": 65,
  "title": "Candidates dilute resumes as job market tightens",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/Candidates-dilute-resumes-as-job-market-tightens-1-400x299.jpg",
  "excerpt": "Job hunters are playing down their skills and experience to match the required role, even if it means accepting lower designation and pay, at a time […]",
  "link": "https://www.thehindubusinessline.com/companies/outplacement-services-help-employees-find-new-jobs/article66496176.ece",
  "desc": ["Job hunters are playing down their skills and experience to match the required role, even if it means accepting lower designation and pay, at a time […]"]
},
{
  "id": 66,
  "title": "7 Ways To Craft A Perfect CV",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/13perfect-cv1-400x299.jpg",
  "excerpt": "No matter what field you work in or what stage of your career you are in, metrics-based data always augments your CV, alerts Neelabh Shukla, Chief […]",
  "link": "https://www.peoplematters.in/news/infocus/union-budget-2023-what-companies-are-hoping-to-see-36647",
  "desc": ["No matter what field you work in or what stage of your career you are in, metrics-based data always augments your CV, alerts Neelabh Shukla, Chief […]"]
},
{
  "id": 67,
  "title": "Indian unicorns cut back on employee appraisals as cost-cutting takes priority",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/workplace-740x387-1-400x299.jpg",
  "excerpt": "A majority of over 100 unicorns in India have slashed appraisal budgets for 2023 as the startups increasingly look to cut costs while grappling with a […]",
  "link": "https://www.livemint.com/industry/human-resource/iitians-hefty-pay-comes-with-strings-attached-11670350106008.html",
  "desc": ["A majority of over 100 unicorns in India have slashed appraisal budgets for 2023 as the startups increasingly look to cut costs while grappling with a challenging economic environment."]
},
{
  "id": 68,
  "title": "Bengaluru to lead EV job spike to 5 million by 2030: Report",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/representative-image-credit-istock-photo-89-1225751-1686193910-400x299.jpg",
  "excerpt": "India’s ambitious journey to become a top player in the emerging electric vehicle market will be accompanied by 5 million new direct job opportunities, as per […]",
  "link": "/newspage4S7",
  "desc": ["India’s ambitious journey to become a top player in the emerging electric vehicle market will be accompanied by 5 million new direct job opportunities, as per a report."]
},
{
  "id": 69,
  "title": "Dropout to data scientist: Indian firms open to hiring non-tech candidates with relevant skills",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/06/money-control-min-400x299.jpg",
  "excerpt": "Amid a bleak employment market, job-seekers across sectors are now turning to tech upskilling to stay relevant in the techade. But the question also arises if […]",
  "link": "/newspage5S7",
  "desc": ["Amid a bleak employment market, job-seekers across sectors are now turning to tech upskilling to stay relevant in the techade."]
},
{
  "id": 70,
  "title": "The Largest Virtual Career Fair for Women Concludes with Over 500 Profiles Shortlisted by Employers",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/05/Artboard-2@2x-3-400x299.png",
  "excerpt": "Careernet, India’s leading talent solutions provider, recently organised the 4th edition of its ‘Career Fair for Women’. The distinctive career fair led by Careernet Prism, an […]",
  "link": "/newspage6S7",
  "desc": ["Careernet, India’s leading talent solutions provider, recently organised the 4th edition of its ‘Career Fair for Women’."]
},
{
  "id": 71,
  "title": "System of a down round: valuation markdowns hit Indian startups; to affect fundraising, IPO plans",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/05/shutterstock_585067024-400x299.jpg",
  "excerpt": "Some of India’s biggest startup stars have seen their valuations slashed, and fallout is likely to impact fundraising, public offerings and employee morale in the entire […]",
  "link": "/newspage7S7",
  "desc": ["Some of India’s biggest startup stars have seen their valuations slashed, and fallout is likely to impact fundraising, public offerings, and employee morale."]
},
{
  "id": 72,
  "title": "Paving the way for women in technology",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/05/EC_Digital_Hand_Medical_Tech_Health_Technology-400x299.jpg",
  "excerpt": "In recent years, the tech industry has made significant strides toward gender equality, with several companies recognizing the importance of increasing women’s representation in the sector. […]",
  "link": "/newspage8S7",
  "desc": ["In recent years, the tech industry has made significant strides toward gender equality, with several companies recognizing the importance of increasing women’s representation in the sector."]
},
{
  "id": 73,
  "title": "Startups fire 9,400 employees between January- March, more cuts coming",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/04/startup-layoffs-400x299.png",
  "excerpt": "As the funding winter continues, startups laid off about 9,400 employees in the January-March period, according to data from hiring firm Careernet shared exclusively with ET.Edtech […]",
  "link": "/newspage9S7",
  "desc": ["As the funding winter continues, startups laid off about 9,400 employees in the January-March period, according to data from hiring firm Careernet shared exclusively with ET."]
},
{
  "id": 74,
  "title": "Why a four-day work week could prove to be detrimental to employee stress levels?",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/04/shutterstock_2193207939-400x299.jpg",
  "link": "/newspage1S8",
  "excerpt": "The implementation of the four-day workweek has been a topic of growing interest among companies, as it is perceived as a potential strategy to increase […]",
  "desc": ["The implementation of the four-day workweek has been a topic of growing interest among companies, as it is perceived as a potential strategy to increase productivity and improve work-life balance. However, research suggests that such a schedule may lead to higher stress levels among employees."]
},
{
  "id": 75,
  "title": "Tech sector hiring may see a pause for 6 months as companies watch out global trends",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/04/shutterstock_548303656-400x299.jpg",
  "link": "/newspage2S8",
  "excerpt": "Staffing experts expect the next six months – the first two quarters of FY24 – to be grim for IT hiring, which comes ahead of companies […]",
  "desc": ["Staffing experts expect the next six months – the first two quarters of FY24 – to be grim for IT hiring, which comes ahead of companies reassessing their hiring strategies in response to evolving global trends."]
},
{
  "id": 76,
  "title": "Green Jobs Set To Surge",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/04/Green_1680597942-400x299.webp",
  "link": "/newspage3S8",
  "excerpt": "Green jobs refer to employment opportunities in industries and sectors that focus on environmental sustainability and preserving natural resources. India has been actively supporting green growth […]",
  "desc": ["Green jobs refer to employment opportunities in industries and sectors that focus on environmental sustainability and preserving natural resources. India has been actively supporting green growth initiatives, and the surge in green jobs indicates a positive shift towards sustainability."]
},
{
  "id": 77,
  "title": "Building a psychologically safe workplace for a diverse workforce",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/03/Building-a-psychologically-safe-workplace-for-a-diverse-workforce-400x299.jpg",
  "link": "/newspage4S8",
  "excerpt": "In today’s globalized world, diversity has become a major concern for organizations. A diverse workforce can bring a variety of perspectives, ideas, and experiences that can foster innovation and drive organizational success.",
  "desc": ["Creating a psychologically safe workplace where all employees feel valued and respected is essential for cultivating diversity and inclusivity. Employees should feel comfortable expressing their opinions, ideas, and concerns without fear of judgment or reprisal. When employees feel psychologically safe, they are more likely to collaborate, innovate, and contribute to the organization's success."]
},
{
  "id": 78,
  "title": "Pune, Hyderabad, Chennai top three cities for employing female applicants: Survey",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/03/shutterstock_1813816790-400x299.jpg",
  "link": "/newspage6S8",
  "excerpt": "Last year, every third candidate placed by talent solutions provider Careernet was a woman. Pune, Hyderabad, and Chennai are the top three cities in terms of employing female applicants, according to a recent survey.",
  "desc": ["The cities of Pune, Hyderabad, and Chennai have emerged as leaders in promoting gender diversity in the workplace, particularly in the tech industry. According to a survey by talent solutions provider Careernet, these cities have seen a significant increase in the hiring of female candidates, reflecting a positive trend towards gender inclusivity and equal opportunities."]
},
{
  "id": 79,
  "title": "India SVB staff rush into job mkt – Times of India",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/03/high-pay-400x299.jpg",
  "link": "/newspage7S8",
  "excerpt": "Mumbai: A large pool of experienced employees of SVB (Silicon Valley Bank) Global Services India is said to have entered the job market, search firm executives said.",
  "desc": ["The job market in India has witnessed a surge in the number of experienced professionals seeking new opportunities, particularly in the technology sector. According to search firm executives, a significant portion of SVB Global Services India's experienced staff has recently entered the job market, reflecting a dynamic shift in employment trends."]
},
{
  "id": 80,
  "title": "Women in STEM: Empowering Young Women for the Future",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/03/Women-in-STEM-Empowering-Young-Women-for-the-Future-400x299.jpg",
  "link": "/newspage8S8",
  "excerpt": "Science, technology, engineering, and mathematics (STEM) fields have been traditionally male-dominated. The position of women in STEM fields is still poor despite advancements and increasing opportunities.",
  "desc": ["Despite significant advancements in gender equality and women's empowerment, women continue to be underrepresented in science, technology, engineering, and mathematics (STEM) fields. The lack of gender diversity in STEM not only limits opportunities for women but also hinders innovation and progress in these critical sectors. Empowering young women to pursue careers in STEM is essential for building a more inclusive and equitable future."]
},
{
  "id": 81,
  "title": "Campus hiring may take a hit as IT firms delay onboarding",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/02/1665923517-4102-400x299.jpg",
  "link": "/newspage9S8",
  "excerpt": "Top Indian IT companies delaying the onboarding of freshers hired in FY23 may give rise to a bigger problem, worsening the employment outlook for the tech industry.",
  "desc": ["The delay in onboarding fresh graduates by top Indian IT companies could have far-reaching consequences for the tech industry and the overall employment landscape. With the potential to exacerbate existing challenges in job creation and economic recovery, this delay underscores the need for strategic workforce planning and agile talent management practices."]
},
{
  "id": 82,
  "title": "Building up diversity by breaking down biases in the workplace",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/Careernet-Prism-offers-several-solutions-400x299.webp",
  "link": "/newspage1S9",
  "excerpt": "Workplace diversity and inclusion (D&I) are no longer merely notions that companies use to promote a positive employer brand. This term is at the forefront of organizational strategies.",
  "desc": ["Workplace diversity and inclusion (D&I) have transitioned from being mere buzzwords to strategic imperatives for organizations worldwide. By fostering an environment where individuals from diverse backgrounds feel valued, respected, and empowered, companies can unlock the full potential of their workforce and drive innovation, growth, and sustainability."]
},
{
  "id": 83,
  "title": "Are mid-management roles the next target in tech layoffs? Here’s what experts have to say",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/mid-management-roles-the-next-target-in-tech-layoffs-400x299.webp",
  "link": "/newspage2S9",
  "excerpt": "As per Anshuman Das, CEO and Co-founder, Careernet in cost cutting measures non-revenue generating projects and non-performing teams or employees have to bear the brunt.",
  "desc": ["The tech industry is witnessing a shift in workforce dynamics as companies prioritize cost-cutting measures and operational efficiency. While mid-management roles may not always be the primary target in tech layoffs, organizations are increasingly scrutinizing their organizational structures and streamlining operations to remain competitive in a rapidly evolving market."]
},
{
  "id": 84,
  "title": "Bad news awaiting tech grads entering the job market",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/tech-grads-may-have-to-settle-for-2-4-lakh-pay-400x299.webp",
  "link": "/newspage3S9",
  "excerpt": "Technology companies are likely to hire engineering graduates at the previous year’s levels of ₹2-4 lakh per annum, industry experts said, adding they expect no increase […]",
  "desc": ["As the job market becomes increasingly competitive, technology graduates may face challenges in securing employment opportunities that offer competitive compensation and career growth prospects. With technology companies maintaining salary levels and limited scope for pay increases, tech graduates may need to adjust their expectations and explore alternative pathways to enter the workforce."]
},
{
  "id": 85,
  "title": "Jobs Vs Profits: Firing the Only Path to Profitability?",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/Anshumans-1-1-400x299.jpg",
  "link": "/newspage4S9",
  "excerpt": "Mark Zuckerberg says this is a year of efficiency. Yahoo says it will slash 20 percent workforce. Disney slashes 7,000 jobs. The list is too long […]",
  "desc": ["The trade-off between maintaining jobs and maximizing profits has become a contentious issue in the corporate world. While some companies prioritize efficiency and cost-cutting measures to enhance profitability, others argue that such strategies often come at the expense of employee livelihoods and organizational morale. The recent wave of layoffs across various industries has reignited debates about the ethical implications of prioritizing profits over people."]
},
{
  "id": 86,
  "title": "New opportunities. Outplacement services help employees find new jobs",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/Samaritan-groupGBKAPLNB2.4.jpg-400x299.jpg",
  "link": "/newspage5S9",
  "excerpt": "As thousands of employees have lost their jobs in the ongoing funding winter, startups have put in place outplacement support for laid-off employees to find their […]",
  "desc": ["In response to the ongoing wave of job losses and economic uncertainties, many startups and organizations have implemented outplacement services to support displaced employees in finding new job opportunities. By providing career transition assistance, resume writing, and job search resources, these outplacement programs aim to mitigate the impact of layoffs and facilitate smoother transitions for affected individuals into new roles."]
},
{
  "id": 87,
  "title": "Going slow: Infosys, Wipro keep Class of 2023 waiting for campus hiring",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/02/Going-slow-Infosys-Wipro-keep-Class-of-2023-waiting-for-campus-hiring-400x299.jpg",
  "link": "/newspage6S9",
  "excerpt": "Excess hiring in the previous year and continued economic uncertainties are affecting campus recruitment by top information technology IT services players Anshuman Das chief executive officer […]",
  "desc": ["The pace of campus hiring by top information technology (IT) services companies, such as Infosys and Wipro, has slowed down due to several factors, including excess hiring in previous years and ongoing economic uncertainties. As a result, the Class of 2023 may experience delays in securing job offers from these prominent IT players, highlighting the importance of adaptability and resilience in navigating the evolving job market landscape."]
},
{
  "id": 88,
  "title": "Talent acquisition in a hybrid-work world",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/shutterstock_2129474939-400x299.webp",
  "link": "/newspage7S9",
  "excerpt": "The implementation of a flexible hybrid work model, which combines working from home and in an office setting, has become increasingly popular in today’s business environment. […]",
  "desc": ["The rise of hybrid work models, blending remote and in-office work, has necessitated adjustments in talent acquisition strategies. Employers are now seeking candidates who demonstrate strong communication skills, adaptability, and self-motivation, as remote collaboration becomes integral to organizational success. Successfully navigating this hybrid work landscape requires a strategic approach to talent acquisition that prioritizes flexibility and inclusivity."]
},
{
  "id": 89,
  "title": "IT costoaxe 2,500 new hires who flunked screening tests",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/02/IT_1675883389929_1675883400731_1675883400731-400x299.webp",
  "link": "/newspage8S9",
  "excerpt": "Indian software service providers may let go of around 2,500 recent recruits for failing screening tests mere months after they were onboarded, even as some industry […]",
  "desc": ["Several Indian software service providers are considering terminating the employment of approximately 2,500 recent hires who did not meet the required performance standards during screening tests. This decision underscores the importance of rigorous candidate evaluation processes in ensuring the quality and suitability of new hires. As companies prioritize efficiency and competitiveness, maintaining high standards for talent acquisition remains crucial in driving organizational success."]
},
{
  "id": 90,
  "title": "Startups fired 6,000 in October-December 2022, 4,000 in January 2023 alone",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/02/layoffs-in-2023-full-list-of-companies-that-have-announced-job-cuts-amid-economic-downturn-400x299.webp",
  "link": "/newspage9S9",
  "excerpt": "Startups in India fired about 6,000 employees in October-December 2022 and another 4,000 or so in January 2023 alone, according to a CIEL HR Services study […]",
  "desc": ["Startups in India fired about 6,000 employees in October-December 2022 and another 4,000 or so in January 2023 alone, according to a CIEL HR Services study […]"]
},
{
  "id": 91,
  "title": "78 percent Indian workers uneasy about job security amid layoffs: Survey",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/01/shutterstock_1529313695-400x299.jpg",
  "excerpt": "Rising inflation, fear of recession and job security amid layoffs are the trends that are making the Indian workforce cautious in 2023. According to LinkedIn Workforce [...]",
  "link": "/newspage1S10",
  "desc": ["Rising inflation, fear of recession and job security amid layoffs are the trends that are making the Indian workforce cautious in 2023. According to LinkedIn Workforce [...]"]
},
  {
    "title": "Tech CVs pile up at job search companies as professionals seek secure options",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/01/tech-job-400x299.jpg",
    "excerpt": "With almost all big technology companies announcing global layoffs one after the other, professionals in the sector in India are frantically looking for more secure options [...]",
    "link": "/newspage2S10"
  },
  {
    "title": "IIT PLACEMENTS: WHEN HARD WORK DOESN’T PAY",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/01/LSpic_1674583707171_1674583727380_1674583727380-400x299.webp",
    "excerpt": "During the IIT placement season, which begins every year on 1 December and sometimes goes up to April, students from the computer science batch are wooed [...]",
    "link": "/newspage3S10"
  },
  {
    "title": "TCS, Infosys, Wipro, HCLTech net employees addition drops 93% in Q3FY23",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/01/startup-770x435-1-400x299.webp",
    "excerpt": "India’s top four IT companies hired 1,940 employees on a net basis in the third quarter of FY23, down 93 percent from the previous quarter. The [...]",
    "link": "/newspage4S10"
  },
  {
    "title": "Union Budget 2023: What companies are hoping to see",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/01/1674033463-400x299.webp",
    "excerpt": "Raise in tax redemption, incentives, specific schemes to benefit infrastructure and manufacturing, investment in digital infrastructure, a policy that further encourages a sturdy start-up ecosystem through [...]",
    "link": "/newspage5S10"
  },
  {
    "title": "Budget 2023 | Salaried professionals expect more options for safe investments, tax reduction",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/01/Budget-2023-2-1-770x433-1-400x299.jpg",
    "excerpt": "Per current income tax regulations, the rate for the highest income slab, surpassing Rs 5 crore, is 42.74 percent after surcharge and cess. “This is a [...]",
    "link": "/newspage6S10"
  },
  {
    "title": "Jobs 2023: Non-tech, 5G-fuelled telecom to dominate hiring",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/01/hiring-shutterstock-400x299.webp",
    "excerpt": "Experts also believe that although the non-tech sector will drive hiring in 2023, tech-enabled jobs will continue to dominate. “Technology will continue to be the most [...]",
    "link": "/newspage7S10"
  },
  {
    "title": "Are Companies Reconsidering Work From Home Amid Covid-19 Fourth Wave Scare?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/12/Work-From-Home-WFH-400x299.webp",
    "excerpt": "Work From Home Latest Update: In the wake of rising COVID cases, India Inc is reportedly taking a cautious approach to its hiring plans. Reports in [...]",
    "link": "/newspage8S10"
  },
  {
    "title": "Careernet bags The Economic Times Best Brands Awards at ET Best Brands Conclave 2022",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/12/ET-Best-Brand-social-post-%E2%80%93-11-%E2%80%93-5-400x299.png",
    "excerpt": "Careernet, India’s leading talent solutions provider, has been recognised as One of the Best Brands 2022 at the 5th Edition of the Economic Times Best Brands [...]",
    "link": "/newspage9S10"
  },
  {
    "title": "India Inc reconsiders WFH, hiring as covid cases go up",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/12/indiainc_1671987400741_1671987407188_1671987407188-400x299.webp",
    "excerpt": "India Inc. is taking a cautious approach to its hiring plans in view of the rising covid-19 cases in many countries, coupled with fears of a",
    "link": "/newspage1S11"
  },
  {
    "title": "Outsourcing Recruitment: A Solution to Fill the Talent-Supply Gap | Anshuman Das | CEO and Co-founder | Careernet",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2022/12/shutterstock_55023025-400x299.jpg",
    "excerpt": "For many firms, the gap between demand and availability of talent is an expensive concern. Without a workforce equipped with the right skills, employees and organisations",
    "link": "/newspage2S11"
  },
  {
    "title": "Career cushioning replaces quiet quitting as the new workplace trend",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/12/Jobs-400x299.webp",
    "excerpt": "Move over from ‘quiet quitting’. Increasing layoffs and job insecurity has given prominence to ‘career cushioning’, which loosely translates as employees being ready with a plan",
    "link": "/newspage3S11"
  },
  {
    "title": "Layoff fallout: Outplacement firms have their hands full with flood of CVs",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2022/12/1656867405-8526-400x299.webp",
    "excerpt": "“We have seen an uptick of about 20-25 per cent in direct job applications and the referral scheme programme on the website, which allows people to",
    "link": "/newspage4S11"
  },
  {
    "title": "Hefty pay of IITians comes with strings attached",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/12/Companies_-_People_1545994191272-400x299.webp",
    "excerpt": "“The fixed-to-other component ratio was 70:30 before the pandemic, and now it is 60:40, and in some sectors, it has become 50:50,” said Anshuman Das, chief",
    "link": "/newspage5S11"
  },
  {
    "title": "Four-day work week is here but will it work for Indian companies?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/12/shutterstock_2026202072-400x299.jpg",
    "excerpt": "Anshuman Das, CEO and co-founder of Careernet suggests that a better and feasible model for India is the hybrid-work model. “With the advent of a hybrid",
    "link": "/newspage6S11"
  },
  {
    "title": "Layoffs — how they affected H-1B visa holders and what options they have",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/11/Layoffs-400x299.png",
    "excerpt": "Layoffs are dominating news headlines these days, with major companies like Twitter, Microsoft, Meta, Intel, HP and Amazon starting to let go of. Laid-off employees with",
    "link": "/newspage7S11"
  },
  {
    "title": "Here is how to survive layoff season | India development debate",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/11/et1-400x299.png",
    "excerpt": "The news from the tech sector remains gloomy. Another giant, Google plans to layoff 10,000 employees after conducting performance reviews. Meanwhile, Amazon has been summoned by",
    "link": "/newspage8S11"
  },
  {
    "title": "Mobileum uncovers 5G and AI: Telecom’s Emerging Technologies at ‘Telecom Tech Reimagined",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/11/Mobileum-Open-position-post-%E2%80%93-1-400x299.png",
    "excerpt": "Mobileum, a global leader in telecom analytics solutions, organised a virtual networking event for tech professionals to explore career opportunities with Mobileum. First in a projected",
    "link": "/newspage9S11"
  },
  {
    "title": "Many laid-off edtech workers open to large pay cuts amid job crunch",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2022/11/jpg-400x299.webp",
    "excerpt": "As a wave of fresh job cuts sweeps across the edtech sector, laid-off professionals and worried employees at troubled firms are reaching out for placements. Recruitment",
    "link": "/newspage1S12"
  },
  {
    "title": "72% of participant profiles shortlisted for 100+ roles during the 4th edition of Careernet Career Fair for Women",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/10/shutterstock_1937642431-400x299.jpg",
    "excerpt": "India’s leading talent solutions provider, Careernet, successfully organised Hitachi Presents Careernet Prism Career Fair for Women, Powered by Biocon and Co-powered by Sapiens, on August 27",
    "link": "/newspage2S12"
  },
  {
    "title": "72% Of Participant Profiles Shortlisted In Career Fair For Women",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_290/https://careernet.in/wp-content/uploads/2022/10/1594753287_jCFEso_images.jpg",
    "excerpt": "India’s talent solutions provider, Careernet, organised Hitachi Presents Careernet Prism Career Fair for Women, Powered by Biocon and Co-powered by Sapiens, on August 27, 2022. The",
    "link": "/newspage3S12"
  },
  {
    "title": "Pregnancy to prejudice, biases haunt the Indian workplace — what’s the way out?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/10/workplace-1019x573-1-400x299.webp",
    "excerpt": "Another common bias prevalent in the workplace is the ‘unconscious bias,’ which has an impact on whether certain individuals get hired or not. Unconscious biases occur",
    "link": "/newspage4S12"
  },
  {
    "title": "PM Modi bats for work from home, but Indian companies are divided",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/09/work-from-home-sixteen_nine-400x299.jpg",
    "excerpt": "While Prime Minister Narendra Modi has exhorted the value of work-from-home (WFH) to increase the participation of women in the Indian workforce, most firms have resorted",
    "link": "/newspage5S12"
  },
  {
    "title": "How can lateral recruitment process be simplified to win the war for talent",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/08/How-can-lateral-recruitment-process-be-simplified-to-win-the-war-for-talent-400x299.jpg",
    "excerpt": "Lateral hiring entails selecting candidates with at least a few years of experience in similar roles to fill open positions. This form of recruiting enables businesses",
    "link": "/newspage6S12"
  },
  {
    "title": "1000+ Women Professionals At The Third Edition Of Careernet’s ‘Career Fair For Women’",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/08/1000-Women-Professionals-At-The-Third-Edition-Of-Careernets-%E2%80%98Career-Fair-For-Women-400x299.jpg",
    "excerpt": "Careernet, India’s leading talent solutions provider is set to host Hitachi Presents Careernet Prism Career Fair for Women, Powered by Biocon and Co-powered by Sapiens, on",
    "link": "/newspage7S12"
  },
  {
    "title": "Over 100 Jobs To Be Hosted For 1,000+ Women Professionals At The Third Edition Of Careernet’s ‘Career Fair For Women’",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/03/CN-Logo-400x299.png",
    "excerpt": "Careernet, India’s leading talent solutions provider is set to host Hitachi Presents Careernet Prism Career Fair for Women, Powered by Biocon and Co-powered by Sapiens, on",
    "link": "/newspage8S12"
  },
  {
    "title": "Careernet To Host ‘Career Fair For Women’",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/08/Careernet-To-Host-%E2%80%98Career-Fair-For-Women-400x299.jpg",
    "excerpt": "Careernet, India’s talent solutions provider is set to host Hitachi Presents Careernet Prism Career Fair for Women, powered by Biocon and co-powered by Sapiens, on August",
    "link": "/newspage9S12"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/08/Virtual-fair-to-offer-100-jobs-for-women-across-IT-domains-400x299.jpg",
    "title": "Virtual fair to offer 100 jobs for women across IT domains",
    "link": "/newspage1S13",
    "excerpt": "In a move aimed at furthering careers of women employees, Careernet, a talent solutions provider, has partnered with a bunch of firms to organise a virtual […]"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/08/17-25_IMG_8240-MitaRoyPhotography-400x299.jpg",
    "title": "‘Moonlighting’ is a double-edged sword! Beware of legal repercussions",
    "link": "/newspage2S13",
    "excerpt": "‘Moonlighting’ can be a double-edged sword for employees in India, experts say. The practice of working on side jobs and part-time assignments while being employed full-time […]"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/08/economy-1-400x299.webp",
    "title": "Short-term demand for digital talent dips as global economy slows, funding dries up",
    "link": "/newspage3S13",
    "excerpt": "Typically, four sets of companies are looking for digital talent – digital natives or startups, IT services companies, global capability centres (GCCs), and traditional companies that […]"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/07/women-computers-reuters-400x299.jpg",
    "title": "Will Indian IT services segment face growth pangs in near term?",
    "link": "/newspage4S13",
    "excerpt": "Recently Rishad Premji, the Wipro chairman, said that the technology services industry, at some level, is recession proof. Will it really remain recession proof? Indian IT […]"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/06/image-400x299.png",
    "title": "The Rise of Hi-tech HR Start-ups",
    "link": "/newspage5S13",
    "excerpt": "Recruiting firm Careernet’s CEO and Co-founder Anshuman Das says Covid-19 showed companies that remote, online hiring could be efficient, cost-saving and done at scale. He gives […]"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2022/04/CFW-unit-400x299.png",
    "title": "1,100 profiles shortlisted for 100+ job roles in Careernet’s annual ‘Career Fair for Women’",
    "link": "/newspage6S13",
    "excerpt": "Careernet, India’s leading talent solutions provider, successfully organised ‘Career Fair for Women’, presented by Jar, powered by Syfe, co-powered by Hitachi, and supported by Roche, Mobileum, […]"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/04/image-400x299.png",
    "title": "How leading organisations are approaching hybrid work",
    "link": "/newspage7S13",
    "excerpt": "Mr. Anshuman Das is quoted in this story along with Sreelakshmi Venugopal, Head of HR at Embassy Services, Sunjoy Dhaawan, VP of Human Resources at DHL […]"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/04/lead_2-400x299.webp",
    "title": "Nearly 66.5% of candidates believe flexible work options will encourage more women to join workforce",
    "link": "/newspage8S13",
    "excerpt": "Nearly 66.5 percent of candidates believe flexible work options will encourage more women to join the workforce. While 36.5 percent of candidates believe commute is the […]"
  },
  {
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/03/CN-Logo-400x299.png",
    "title": "1,100 Profiles Shortlisted for 100+ Job Roles in Careernet’s Annual ‘Career Fair for Women’",
    "link": "/newspage9S13",
    "excerpt": "Careernet, India’s leading talent solutions provider, successfully organised ‘Career Fair for Women’, presented by Jar, powered by Syfe, co-powered by Hitachi, and supported by Roche, Mobileum […]"
  },
  {
    "title": "As Work From Office Begins, Indian Employees Want to Change the Way Offices Work",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/04/shutterstock_1039453264-16504385273x2-1-400x299.webp",
    "link": "/newspage1",
    "excerpt": "After being dragged out of the offices due to the pandemic and being forced to work from home, most Indian employees are now liking the comfort"
  },
  {
    "title": "As ‘ghosting’ haunts employers, wounded HR representatives take to Linkedin to call candidates out. Experts call it unethical",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2022/04/ghosting-tn-400x299.webp",
    "link": "/newspage2",
    "excerpt": "Before the pandemic, the acceptance rate after the offer was rolled out used to be about 80%, which has dropped in general to 60% acceptance now,"
  },
  {
    "title": "A Welcome Change: India Sees A Rise In Women’s Employment In The Post Pandemic World",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/04/215375-untitled-design-28-400x299.jpg",
    "link": "/newspage3",
    "excerpt": "Yet, the opportunity of working from home, hybrid working and flexible trimmings brought in a lot of scope to women who wished to make a comeback"
  },
  {
    "title": "Will attaining diversity in a workplace empower organisations to win the war for talent?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_960/https://careernet.in/wp-content/uploads/2021/12/Anshuman-Das-Co-Founder-CEO-Careernet-960x720.jpg",
    "link": "/newspage5",
    "excerpt": "Anshuman Das, CEO and Co-founder, Careernet, has two decades of experience in the search and selection and technology industry. He started his professional journey with Careernet"
  },
  {
    "title": "Women job applications increasing, but retention remains key to achieving a diverse workforce",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2022/03/Women-work-400x299.jpg",
    "link": "/newspage4",
    "excerpt": "Data shows a phenomenal increase in women applying for jobs on various platforms coupled with a majority of them in the process of rejoining the workforce."
  },
  {
    "title": "Every third candidate placed in 2021 was a woman, says Careernet",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2022/03/Jobs-growth-people-400x299.jpg",
    "link": "/newspage6",
    "excerpt": "A recent report by talent solutions provider Careernet states that every third candidate placed by the company was a woman. According to Careernet’s internal data, of"
  },
  {
    "title": "The story behind Careernet’s unique rebranding journey",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/03/CN-Logo-400x299.png",
    "link": "/newspage7",
    "excerpt": "India’s leading talent solutions provider, Careernet, recently revamped its logo and website, designed to upgrade and elevate the user experience. In over 20 years of its"
  },
  {
    "title": "U-turn now after the Great Resignation",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/03/jobs_1646074055992_1646074069374-400x299.webp",
    "link": "/newspage8",
    "excerpt": "The great resignation is seeing a reversal, with many employees leaving their new jobs to return to their former employers. Recruiters are terming this phenomenon as"
  },
  {
    "title": "How Great Resignation is turning into Great Reshuffle",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2022/02/image-1-400x299.jpg",
    "link": "/newspage9",
    "excerpt": "The Great Resignation saga, as it is termed, is a phenomenon primarily observed in countries with a per capita income of $20,000 onwards, explained Anshuman Das,"
  },
  {
    "id": 1,
    "title": "Virtual hiring is here to stay, businesses need to invest in the necessary tech",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/02/shutterstock_1782206597-400x299.jpg",
    "excerpt": "Careernet, India’s leading talent solutions provider, has been a trusted partner in the growth journey of organisations of all sizes, starting from start-ups to Fortune 500",
    "link": "/newspage1"
  },
  {
    "id": 2,
    "title": "Careernet unveils new brand identity for a tech-first world",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/02/Careernet-unveils-new-brand-identity-for-a-tech-first-world-400x299.jpg",
    "excerpt": "“It is tech that will definitely transform Bharat into India,” asserts Anshuman Das, CEO and Co-founder, Careernet. The homegrown talent solutions provider was co-founded in 1999",
    "link": "/newspage2"
  },
  {
    "id": 3,
    "title": "Budget 2022: From tax relief to ease of doing business, here’s what corporates want from finance minister",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/02/0102_20210201008l-400x299.webp",
    "excerpt": "Corporates have a long wishlist for Budget 2022 and hope Finance Minister Nirmala Sitharaman would have factored it in. From relief in taxes, internet connectivity, incentivising",
    "link": "/newspage3"
  },
  {
    "id": 4,
    "title": "Remote working culture | Anshuman Das | CEO & Co-founder | Careernet",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_960/https://careernet.in/wp-content/uploads/2021/12/Anshuman-Das-Co-Founder-CEO-Careernet-960x720.jpg",
    "excerpt": "Remote working culture has resulted in a thin line of difference between work and home in the last 24 months. This calls for revisiting certain regulatory",
    "link": "/newspage5"
  },
  {
    "id": 5,
    "title": "How India Inc is ensuring inclusion for LGBTQ employees",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/02/How-India-Inc-is-ensuring-inclusion-for-LGBTQ-employees-400x299.png",
    "excerpt": "According to the Corporate Equality Index (CEI) 2021, around 767 companies achieved a top score for LGBTQ inclusive workplace policies despite having a tough year in",
    "link": "/newspage4"
  },
  {
    "id": 6,
    "title": "Can women find better prospects in the gig economy?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/01/1641230690-400x299.jpg",
    "excerpt": "Gig work may have created a buzz around the globe in less than a decade, but it carries the potential to boost the employment prospects of",
    "link": "/newspage6"
  },
  {
    "id": 7,
    "title": "7 important talent acquisition trends to watch out for in 2022",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2022/01/talent-acquisition-1639467144514-400x299.png",
    "excerpt": "The most essential end-of-the-year task for talent acquisition teams is to develop a specific action plan to enhance their recruitment operations. Here are seven key talent",
    "link": "/newspage7"
  },
  {
    "id": 8,
    "title": "Challenges faced by startups amid global pandemic",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2021/12/what-you-can-expect-from-2-400x299.jpg",
    "excerpt": "The pandemic has pushed a big percentage of the global workforce to engage in a remote-work experiment on a never-before-seen scale, and a lot changed in",
    "link": "/newspage8"
  },
  {
    "id": 9,
    "title": "Here’s what you can expect from 2022 in terms of hiring",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/12/what-you-can-expect-from-2022-in-terms-of-hiring-768x576.jpg",
    "excerpt": "Due to the Covid-19 pandemic, 2020-21 was very challenging for both recruiters and job seekers. The Indian job market saw a lot of changes in the",
    "link": "/newspage9"
  },
  {
    "title": "How has covid-19 catalysed the growth of recruitment process outsourcing?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/12/shutterstock_524374393-960x720.webp",
    "excerpt": "Harish, a talent acquisition (TA) leader of a large organisation, was faced with the inevitable situation of downsizing the workforce during the initial stages of the",
    "link": "/newspage1"
  },
  {
    "title": "Careernet announces rebranding",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/12/careernet-logo-768x576.png",
    "excerpt": "Careernet, the talent solutions provider, has announced the launch of its new corporate brand identity. As part of the rebranding process, Careernet has revamped its logo",
    "link": "/newspage2"
  },
  {
    "title": "Anshuman Das: Leading always comes from an inspiration to do better",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/12/Custom-Size-%E2%80%93-1-960x720.png",
    "excerpt": "Anshuman Das is Co-Founder and CEO of Careernet, Longhouse Consulting and HirePro. He holds a BTech degree in Textile Technologies from IIT Delhi and serves on",
    "link": "/newspage3"
  },
  {
    "title": "Upward Demand in Temporary CXOs During the Pandemic",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_960/https://careernet.in/wp-content/uploads/2021/12/Anshuman-Das-Co-Founder-CEO-Careernet-960x720.jpg",
    "excerpt": "Since the emergence of the COVID-19 pandemic, the work culture in organisations around the world has been rapidly altering. The paradigm shift in employment practices has",
    "link": "/newspage5"
  },
  {
    "title": "India Inc records 29% upswing in salaries offered to candidates: Survey",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/12/shutterstock_126901889-960x720.webp",
    "excerpt": "India Inc. has recorded a 29% upswing in salaries offered to candidates during recovery phase of the pandemic, according to an analysis of internal data from",
    "link": "/newspage4"
  },
  {
    "title": "Changing paradigm of women returning to work after a break",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/shutterstock_1951228144-960x720.jpg",
    "excerpt": "Industry experts say despite women rising to the top of their careers, it’s not easy for them to return to their professional careers after taking a",
    "link": "/newspage6"
  },
  {
    "title": "Careernet’s ‘Women in Tech’ Virtual Career Fair",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/1-312-profiles-shortlisted-960x720.jpg",
    "excerpt": "312 Profiles Shortlisted for 130 Plus Tech Job Roles on Offer in Careernet’s ‘Women in Tech’ Virtual Career Fair CareerNet, India’s leading talent solutions provider, successfully",
    "link": "/newspage7"
  },
  {
    "title": "Careernet’s ‘Women in Tech’ Shortlists 312 Profiles for Tech Jobs",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/2-careernets-women-in-tech-960x720.jpg",
    "excerpt": "312 Profiles shortlisted for 130+ tech job roles on offer in Careernet’s ‘Women in Tech’ virtual career fair. Careernet, India’s leading talent solutions provider, successfully organisedt",
    "link": "/newspage8"
  },
  {
    "title": "Jobs don’t have gender!",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/5-jobs-dont-have-gender-1-960x720.jpg",
    "excerpt": "Employers should provide equal growth opportunities and create an ecosystem that makes employees feel valued, respected, and accepted. Ensuring this can pave the way for their",
    "link": "/newspage9"
  },
  {
    "title": "Why there is an upsurge in women candidates’ placements across industries",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/4-upsurge-in-women-candidates-960x720.jpg",
    "link": "/newspage1",
    "excerpt": "In the fiscal year, 2020-21, talent solutions provider CareerNet placed an average of 15 female candidates every day. Today, every 4th candidate placed by the company […]"
  },
  {
    "title": "Looking For A Career in Fintech? Here Are Top Skills, Job Roles in This Emerging Field",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/6career-in-fintech-960x720.jpg",
    "link": "/newspage2",
    "excerpt": "Fintech or financial services and technology, has proven to be a major game-changer in India over the past few years. It has played a vital role […]"
  },
  {
    "title": "8 out of 10 employers are actively hiring now: Careernet Market Study",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/10-8-in-10-hiring-now-960x720.jpg",
    "link": "/newspage3",
    "excerpt": "The corporate workforce has seen its fair share of chaos attributing to the COVID-19 crisis that has altered the traditional ways of doing business across different […]"
  },
  {
    "title": "8 in 10 employers are actively hiring; demand for technology-based talent increasing: Study",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/9-8-in-10-employees-actively-hiring-960x720.jpg",
    "link": "/newspage5",
    "excerpt": "The report by talent acquisition company Careernet titled ‘Present Hiring Outlook in India and the Future of Work’ suggests that 61 per cent of large enterprises […]"
  },
  {
    "title": "Remote working widens the horizon for including diverse talent",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/11-remote-working-widens-diverse-960x720.jpg",
    "link": "/newspage4",
    "excerpt": "Nirmala Menon, CEO and Founder, Interweave Consulting, said, “The minute we earmark roles for women, people with disabilities and LGBTQ+ candidates, it would be in the […]"
  },
  {
    "title": "Are There Enough Skilled Individuals for Data Engineering Jobs in India?",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/14-data-engineer-jobs-in-india-960x720.jpg",
    "link": "/newspage6",
    "excerpt": "The demand for data engineers in India has been increasing constantly, and has witnessed a hike especially for the last year. However, there seems to be […]"
  },
  {
    "title": "Careernet launches Prism to help organisations build an inclusive workplace with diverse talent",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/15-careernet-launches-prism-960x720.jpg",
    "link": "/newspage7",
    "excerpt": "Bengaluru (Karnataka) [India], April 5 (ANI/NewsVoir): CareerNet, India’s leading talent acquisition organisation, has announced the launch of CareerNet Prism, a suite of solutions for organisations to […]"
  },
  {
    "title": "Data science jobs, pay zoom amid shifting digital landscape",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/18-launches-prism-17-960x720.jpg",
    "link": "/newspage8",
    "excerpt": "Data science professionals with 3-10 years of experience get annual salaries in the ₹25-65 lakh range, while those with more experience can command pay packages upwards […]"
  },
  {
    "title": "Careernet launches Prism to help organizations build an inclusive workplace with diverse talent",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2021/11/17-Data-science-jobs-960x720.jpg",
    "link": "/newspage9",
    "excerpt": "Careernet, India’s leading talent acquisition organisation, has announced the launch of Careernet Prism, a suite of solutions for organizations to build an inclusive workplace with diverse […]"
  },
  {
    "title": "Hiring may go full throttle by January next year",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_612/https://careernet.in/wp-content/uploads/2021/10/Website_news-image-1-1.jpg",
    "link": "/newspage1",
    "excerpt": "Hiring across the board is expected to resume completely by January after a lull caused by disruptions due to the Covid-19 pandemic although campus recruitment is […]"
  },
  {
    "title": "Companies may resume hiring activity by January 2021: Report",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_612/https://careernet.in/wp-content/uploads/2021/10/Website_news-image-3-1.jpg",
    "link": "/newspage2",
    "excerpt": "Companies have indicated that hiring across the board, with the exception of campus recruitments, will resume by January 2021, a report by Career Net Consulting found […]"
  },
  {
    "title": "CEOs of large Indian start-ups turn to chiefs of staff to get things done",
    "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_612/https://careernet.in/wp-content/uploads/2021/10/Website_news-image-4.jpg",
    "link": "/newspage3",
    "excerpt": "Led by Flipkart, large Indian start-ups are creating a powerful yet loosely defined role of chief of staff to help chief executive officers (CEOs) enforce their […]"
  }
  
  

]
