[
    {
      "id": 1,
      "title": "DEI-LOGS with Kafeel Jafri, DEI Facilitator and Theater Artist",
      "excerpt": "In the latest episode of DEI-LOGS, we had the pleasure of hosting Kafeel Jafri, a multifaceted individual with an MBA from XIME. After 6 years in",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/04/DEI-Logs_Episode-4_Cover_for_webpage-400x299.jpg"
    },
    {
      "id": 2,
      "title": "Careernet Continuum | Episode 3 | Future Focus: Hiring Trends in IT industry in 2024",
      "excerpt": "Harsha Goyal, Senior Vice President, Careernet discusses how the IT sector is constantly evolving and how the hiring strategies are adapting to new technologies and global",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2024/03/Continuum-Episode-3-for-webpage-3X-400x299.jpg"
    },
    {
      "id": 3,
      "title": "DEI-LOGS with Prarthana Kaul, Co founder- GiftAbled",
      "excerpt": "In DEI-LOGS episode 3, Prarthana Kaul, GiftAbled’s Co-founder, emphasises creating an inclusive ecosystem for individuals with disabilities. She discusses the importance of inclusion, highlighting the need",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_295/https://careernet.in/wp-content/uploads/2024/03/DEI-Logs_Episode-3_for_webpage.jpg"
    },
    {
      "id": 4,
      "title": "Careernet Continuum | Episode 2 | Trends and Challenges in Talent Demand within BFSI Global Capability Centers",
      "excerpt": "Ranjeet Singh Narang, Vice President, Careernet, discusses the significance of the BFSI sector to the Indian economy and the GCC landscape, and the emerging hiring trends",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_295/https://careernet.in/wp-content/uploads/2024/02/Continuum-Episode-2-for-webpage.jpg"
    },
    {
      "id": 5,
      "title": "DEI-LOGS with Dr. Anita Prasad, co-founder of Rainbow Angel",
      "excerpt": "Dr. Anita Prasad, co-founder of Rainbow Angels and a dedicated advocate for inclusion, fearlessly shares her remarkable journey as the first Indian-origin transgender woman in Germany.",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_295/https://careernet.in/wp-content/uploads/2024/02/DEI-Logs_Episode-2_Cover_for_webpage.jpg"
    },
    {
      "id": 6,
      "title": "DEI-LOGS with Mr. Roy Thomas of NASSCOM Foundation",
      "excerpt": "Roy C. Thomas, the D&I Lead at NASSCOM Foundation shares a wealth of insights from his impressive 17+ year career. We delve into the significance of",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_295/https://careernet.in/wp-content/uploads/2024/01/DEI-Logs_Episode-1_Roy_cover_for_webpage.png"
    },
    {
      "id": 7,
      "title": "Talent on Demand: GCCs Shaping India’s Employment Future",
      "excerpt": "Anshuman Das, CEO and co-founder of Careernet, discusses the transformative role of Global Capability Centers (GCCs) in shaping India’s employment landscape. Gain insights into the talent-on-demand",
      "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_295/https://careernet.in/wp-content/uploads/2024/01/Continuum-Episode-1-for-webpage.png"
    }
  ]
  