[
  {
  "id": 1,
  "title": "Employment trends in the Electric Vehicle (EV) industry",
  "imageSrc": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/07/IMG_7203-400x299.jpg",
  "excerpt": "India’s ambition to become a top player in the emerging electric vehicle market will lead to 5 million new direct job opportunities, according to a report...",
  "desc": [
    "India’s ambition to become a top player in the emerging electric vehicle market will lead to 5 million new direct job opportunities, according to a report by Careernet. Between 2020 and 2022, EV jobs saw a 110% compound annual growth rate. Bengaluru, a hub for manufacturing and innovation, is expected to become a vital centre for the sector. The top jobs in FY22 were battery management systems and support roles, with engineering and R&D skills being the most sought-after.",
    "Manufacturers and service providers will equip themselves with support roles to transition into the electric vehicle industry. Expats are also showing interest in short-term assignments in India, with pay hikes for those involved in conceptualising, designing, and building core technologies for these vehicles and infrastructure. The formalisation of the economy will also lead to higher paychecks for support roles, and policy outreach will allow their earning potential to scale up."
  ]
},

  {
    "id": 2,
    "title": "The State of LGBTQ+ Hiring in India",
    "imageSrc": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400/https://careernet.in/wp-content/uploads/2023/07/LGBTQ-Banner-400x299.jpg",
    "excerpt": "As part of its commitment to fostering diverse and inclusive workplaces, Careernet Prism, an initiative of Careernet, a leading talent solutions provider in India, conducted...",
    "desc": [
        "As part of its commitment to fostering diverse and inclusive workplaces, Careernet Prism, an initiative of Careernet, a leading talent solutions provider in India, conducted an extensive market study to examine the 'State of LGBTQ+ Hiring in India.' This study involved the participation of 105 LGBTQ+ employees and qualitative interviews with 20 D&I leaders. The findings of the study have been compiled into a comprehensive report, which sheds light on prevailing trends, challenges, and working conditions faced by LGBTQ+ employees in India, as well as the inclusion policies implemented in various workplaces.",
        "The study highlights instances of workplace harassment, discriminatory treatment, and limited job opportunities for the LGBTQ+ community. Furthermore, the report emphasises the lack of LGBTQ+ representation in the workplace, resulting in the neglect of their concerns and grievances. While 50% of the respondents have been open about their community identity at work and feel supported by their organisations, they still face discrimination from co-workers and superiors. It is worth noting that only a small percentage, approximately 15-20%, of employees across organisations are currently sensitised to issues related to the LGBTQ+ community, indicating a need for increased awareness and understanding among co-workers."
      ]
},
  {
    "id": 3,
    "title": "Moving Towards Equality, An overview of the hiring trends in 2022",
    "imageSrc": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_400,h_299/https://careernet.in/wp-content/uploads/2023/04/Moving-Towards-Equality-Report-%E2%80%93-Banner-1-400x299.png",
    "excerpt": "Careernet enables employers to foster gender diversity by placing an increasing number of women candidates over the past few years. In the report “Moving Towards Equality...",
    "desc": [
        "Careernet enables employers to foster gender diversity by placing an increasing number of women candidates over the past few years. In the report 'Moving Towards Equality – an overview of the hiring trends in 2022', we bring out insights into the Indian female workforce across industries. For the report, we studied the data of the calendar year 2022 to analyse hiring sentiments across a comprehensive range of experience levels and industries, spread over 6 cities (Tier-1) across India.",
        "To conduct this analysis, we gathered data from a variety of sources, including internal data, and career portals of employers, and measured the hiring trends. We analysed a sample size of about 16,000 placements in the year 2022. This report focuses on the representation of women in the workforce and unfolds a comprehensive view of current and emerging women talent requirements and possible future trends."
      ]
  },
  {
    "id": 4,
    "title": "Q4 of FY 2020-21 recorded the lowest of 57% joining ratio in the Global Innovation Centres across India",
    "imageSrc": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/11/Report_The_State_of_Job_Affairs_During_COVID_Banner-768x575.jpg",
    "excerpt": "Chennai, Pune, and Delhi/NCR experienced a downward trend in the candidate joining ratio over the last 4 quarters of the FY 2020-21, while Mumbai recorded its...",
    "desc": [
        "Chennai, Pune, and Delhi/NCR experienced a downward trend in the candidate joining ratio over the last 4 quarters of the FY 2020-21, while Mumbai recorded its highest joining ratio in Q4.",
        "This report captures the detailed insights on the massive city and gender wise talent crunch across all the innovation centres in India during the recent past."
      ]
  },
  {
    "id": 5,
    "title": "FY 2020-21 saw a 66% upsurge in the placement of women talent in tech across experience levels.",
    "imageSrc": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/11/Report_Careernet_Fostering_gender_diversity_Banner-768x576.jpg",
    "excerpt": "During the FY2020-21, Careernet placed an average of 15 female candidates every day. Women constituted 27% of all candidates placed by us. This report throws light...",
    "desc": [
        "During the FY2020-21, Careernet placed an average of 15 female candidates every day. Women constituted 27% of all candidates placed by us.",
        "This report throws light on the contribution Careernet has made towards gender diversity by placing women candidates across levels and industries in Bangalore, Hyderabad, Chennai and Pune so far."
      ]
  },
  {
    "id": 6,
    "title": "Present hiring outlook in India: Impact of COVID-19 on hiring",
    "imageSrc": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/11/Report_Careernet_Present_hiring_outlook_in_india_July2020_Banner-768x575.jpg",
    "excerpt": "Almost 50 per cent of the organisations had a medium impact and 25 per cent had low or no impact on their company and its business...",
    "desc": [
        "Almost 50 per cent of the organisations had a medium impact and 25 per cent had low or no impact on their company and its business, during the early phase of COVID-19. Yet, the initial phase of COVID-19 was unpredictable, unprecedented and nothing short of a rollercoaster ride. This study documents the repercussions of the pandemic on the hiring trends of organisations."
      ]
  },
  {
    "id": 7,
    "title": "Job market trends: Job seekers’ preferences during COVID-19",
    "imageSrc": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/11/Report_The_State_of_Job_Affairs_During_COVID_Banner-768x575.jpg",
    "excerpt": "Hyderabad emerged as the most preferred city to work for candidates, while NCR remained the least preferred during the financial year 2020-2021. Gain more inferences about...",
    "desc": [
        "Hyderabad emerged as the most preferred city to work for candidates, while NCR remained the least preferred during the financial year 2020-2021. Gain more inferences about how the job market fared, according to the internal data at Careernet."
      ]
  },
  {
    "id": 8,
    "title": "Present hiring outlook in India and the future of work:",
    "imageSrc": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossless,ret_img,w_768/https://careernet.in/wp-content/uploads/2021/11/Report_Caeernet_Present_hiring_outlook_in_India_and_the_future_of_work_Banner-768x575.jpg",
    "excerpt": "A few months into 2021 got us thinking about the hiring outlook of employers in India. We did a study to gather market insights about the...",
    "desc": [
        "As part of its commitment to fostering diverse and inclusive workplaces, Careernet Prism, an initiative of Careernet, a leading talent solutions provider in India, conducted an extensive market study to examine the 'State of LGBTQ+ Hiring in India.' This study involved the participation of 105 LGBTQ+ employees and qualitative interviews with 20 D&I leaders. The findings of the study have been compiled into a comprehensive report, which sheds light on prevailing trends, challenges, and working conditions faced by LGBTQ+ employees in India, as well as the inclusion policies implemented in various workplaces.",
        "The study highlights instances of workplace harassment, discriminatory treatment, and limited job opportunities for the LGBTQ+ community. Furthermore, the report emphasises the lack of LGBTQ+ representation in the workplace, resulting in the neglect of their concerns and grievances. While 50% of the respondents have been open about their community identity at work and feel supported by their organisations, they still face discrimination from co-workers and superiors. It is worth noting that only a small percentage, approximately 15-20%, of employees across organisations are currently sensitised to issues related to the LGBTQ+ community, indicating a need for increased awareness and understanding among co-workers."
      ]
  }
]
